src/org-files/maquinas-virtuales.org
* Virtualbox
  Agregar a la guia actual

** 1. Instalacion de Virtualbox
   Nos aseguramos de instalar una version que se adapte a nuestro kernel

   #+BEGIN_SRC sh
     # La version que nos diga sera la que agregamos
     mhwd-kernel -li
     # Instalamos virtualbox (suponiendo que tu kernel es linux54)
     sudo pacman -Syu virtualbox linux54-virtualbox-host-modules
     # Cargamos virtualbox
     sudo vboxreload
     # Instalamos la version extendida que agrega nuevas funcionalidades
     pamac build virtualbox-ext-oracle
     # Agregamos el usuario actual al grupo de usuarios vbox
     sudo gpasswd -a $USER vboxusers
   #+END_SRC
   
** 2. Instalar Vagrant

   #+BEGIN_SRC sh
     # Instalamos vagrant
     pacman -S vagrant
     # Instalamos plugins 
     # vagrant plugin install vagrant-vbguest vagrant-share
     # creamos directorio donde instalar sl ervidor
     mkdir manu-server 
     cd manu-server 
     # Inicializamos con una distribucion centos 7 como servidor linux
     # vagrant box add centos-7.0-x86_64.box --name centos7

     # vagrant init centos/7
     vagrant init ubuntu/trusty64

     # Descargamos e instalamos el servidor linux 
     vagrant up 
     # Nos conectamos al servidor
     vagrant ssh
   #+END_SRC
   
   | Comando           | Descripcion                                |
   | :------           | :----------                                |
   | vagrant provision | Instalar paquetes agregados en Vagrantfile |
   | vagrant halt      |                                            |
   | vagrant up        | Descargar e instalar un box                |
   | vagrant ssh       | Conectarse al servidor                     |
   | vagrant init      | Inicializar                                |

   
   *Referencias*
   - https://wiki.archlinux.org/index.php/Vagrant
   - https://www.vagrantup.com/docs/boxes/base.html
   - https://www.vagrantup.com/intro/getting-started/provisioning.html
   - https://dev.to/psnebc/vagrant-package-and-vagrant-box-add-8of
   - https://medium.com/@Joachim8675309/vagrant-provisioning-e4c9fd57968d
   - https://scotch.io/courses/getting-started-with-vagrant-for-local-development/provisioning-vmprovision-how-to-customize-the-box
   - https://blog.ipswitch.com/installing-your-first-vagrant-box
   - https://computingforgeeks.com/how-to-addinstall-and-run-centos-7-vagrant-box-to-virtualbox-using-vagrant/

** 3. Configurar Servidor
   En este caso usaremos ubuntu/trusty64
   No tuve que crear particiones extra (chequear con blogs, y mas info por si acaso)

   Compartir Carpetas
   - https://blog.theodo.com/2017/07/speed-vagrant-synced-folders/
   - https://www.vagrantup.com/docs/synced-folders/basic_usage
   - https://stackoverflow.com/questions/19231895/how-to-share-a-folder-created-inside-vagrant
   
   Referencias
   - https://www.2daygeek.com/how-to-resize-active-primary-root-partition-in-linux-using-gparted-utility/
   - https://access.redhat.com/articles/1190213
   - https://kwilson.io/blog/format-a-linux-disk-as-ext4-from-the-command-line/
   - https://www.tecmint.com/create-new-ext4-file-system-partition-in-linux/
   -
** 4. Configurar red
   La idea es poder correr algun servidor web por ejemplo con prolog
   y poder acceder via tu maquina

   - https://www.oreilly.com/library/view/vagrant-up-and/9781449336103/ch04.html
   - https://www.vagrantup.com/docs/networking/public_network.html
   - https://stackoverflow.com/questions/33250304/how-to-automatically-select-bridged-network-interfaces-in-vagrant
