dist/maquinas-virtuales.html
<!--?xml version="1.0" encoding="utf-8"?--><!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en"><head>
<!-- 2021-03-31 mié 00:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>‎</title>
<meta name="generator" content="Org mode">
<meta name="author" content="jelou">
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgec0ce65">1. Virtualbox</a>
<ul>
<li><a href="#orgab5b0af">1.1. 1. Instalacion de Virtualbox</a></li>
<li><a href="#org6a25703">1.2. 2. Instalar Vagrant</a></li>
<li><a href="#org5940314">1.3. 3. Configurar Servidor</a></li>
<li><a href="#org063bf40">1.4. 4. Configurar red</a></li>
<li><a href="#org97c6430">1.5. Referencias</a></li>
</ul>
</li>
<li><a href="#org7515c08">2. Docker</a>
<ul>
<li><a href="#org3d011ce">2.1. Conceptos</a>
<ul>
<li><a href="#orga2664b4">2.1.1. Imagen</a></li>
<li><a href="#org0639169">2.1.2. Contenedor</a></li>
</ul>
</li>
<li><a href="#orgc82f4e5">2.2. Instalación</a></li>
<li><a href="#org7559a98">2.3. Comandos básicos</a>
<ul>
<li><a href="#orgfce7209">2.3.1. Lista de Comandos</a></li>
<li><a href="#org3f47acf">2.3.2. Lista de parámetros</a></li>
<li><a href="#org0dfb0cb">2.3.3. Observaciones importantes</a></li>
<li><a href="#org8b9c0b3">2.3.4. Crear Contenedores en primer y segundo plano</a></li>
<li><a href="#org4b1a8b8">2.3.5. Crear Imagenes</a></li>
<li><a href="#orgdcae032">2.3.6. Eliminar multiples Contenedores</a></li>
<li><a href="#org753515e">2.3.7. Eliminar multiples imagenes</a></li>
<li><a href="#org94158a6">2.3.8. Descargar ó Actualizar un Contenedor</a></li>
<li><a href="#orgb023564">2.3.9. Listar contenedores en ejecución e inactivos</a></li>
<li><a href="#orgab33918">2.3.10. Acceder ó Iniciar/Detener ejecución de contenedores</a></li>
<li><a href="#org6fb5c7e">2.3.11. Versionar containers</a></li>
<li><a href="#org40e7e1d">2.3.12. Abrir Puertos</a></li>
<li><a href="#orge4e91e4">2.3.13. Referencias Web</a></li>
</ul>
</li>
<li><a href="#orge6f189a">2.4. Estados</a></li>
<li><a href="#orgaefc54e">2.5. Probando</a>
<ul>
<li><a href="#org78922da">2.5.1. Probando Alpine (Linux)</a></li>
<li><a href="#org7627fd0">2.5.2. Probando Debian (Linux)</a></li>
<li><a href="#orge15e171">2.5.3. Actualmente en uso</a></li>
<li><a href="#orgeafa8c6">2.5.4. Ubuntu</a></li>
</ul>
</li>
<li><a href="#org35b333e">2.6. Configurando Puertos</a></li>
<li><a href="#org2d2b3e7">2.7. Configurando Volumenes</a>
<ul>
<li><a href="#org6fadfe9">2.7.1. Conceptos</a></li>
<li><a href="#orgfbb2f71">2.7.2. Ejemplos</a></li>
<li><a href="#org336f743">2.7.3. Referencias</a></li>
</ul>
</li>
<li><a href="#orge448cc0">2.8. Configurando Redes Docker</a>
<ul>
<li><a href="#org7498633">2.8.1. Conceptos</a></li>
<li><a href="#orgecfc838">2.8.2. Crear Red</a></li>
<li><a href="#org2d89c2b">2.8.3. Referencias</a></li>
</ul>
</li>
<li><a href="#org43553bb">2.9. Ejemplos</a></li>
<li><a href="#org48fb01c">2.10. Referencias</a></li>
<li><a href="#org336a0ab">2.11. Referencias - Videos</a></li>
</ul>
</li>
<li><a href="#orgb4483e4">3. Dockerfile</a>
<ul>
<li><a href="#orga23d0d5">3.1. Conceptos</a></li>
<li><a href="#org60cd0e3">3.2. Comandos básicos</a>
<ul>
<li><a href="#org8219cb3">3.2.1. (BUILD) Crear Imagen</a></li>
<li><a href="#org7b2347f">3.2.2. (COPY) Copiar archivos</a></li>
<li><a href="#org6824d1e">3.2.3. (ADD) Descargar y Descomprimir archivos</a></li>
<li><a href="#orgb2626b1">3.2.4. (ENTRYPOINT) Pasar scripts por parámetro</a></li>
<li><a href="#org45f6e2a">3.2.5. (CMD) Comandos por defecto</a></li>
<li><a href="#orgec7c2cc">3.2.6. (RUN) Ejecutar comandos</a></li>
<li><a href="#org6940337">3.2.7. Otros</a></li>
</ul>
</li>
<li><a href="#org89358a3">3.3. Ejemplos</a></li>
</ul>
</li>
<li><a href="#org57e269f">4. Docker Compose</a>
<ul>
<li><a href="#org0fc92a8">4.1. Conceptos</a></li>
<li><a href="#orgb678b24">4.2. Instalación &amp;&amp; Configuración</a></li>
<li><a href="#org750702c">4.3. Comandos Básicos</a></li>
<li><a href="#orgb9d7165">4.4. Ejemplos</a></li>
<li><a href="#org24c0434">4.5. Referencias Web</a></li>
<li><a href="#org170c037">4.6. Referencias Youtube</a></li>
<li><a href="#org5372bdd">4.7. Issues Comunes</a></li>
</ul>
</li>
<li><a href="#org49f9eb5">5. Docker Tips</a>
<ul>
<li><a href="#orgdca0195">5.1. Ejecutar contenedores al iniciar el sistema</a></li>
<li><a href="#org38ba533">5.2. Conocer el timestamp de los logs</a></li>
</ul>
</li>
<li><a href="#org79b93b7">6. Servicios Básicos</a>
<ul>
<li><a href="#org86d9073">6.1. Nginx</a></li>
<li><a href="#org3f85acd">6.2. Duckdns</a>
<ul>
<li><a href="#orgf193787">6.2.1. Referencias</a></li>
</ul>
</li>
<li><a href="#org3cc4a89">6.3. Inspircd</a></li>
<li><a href="#orgb1a75a5">6.4. Referencias Web</a></li>
<li><a href="#org490f62f">6.5. Videotutoriales</a></li>
</ul>
</li>
<li><a href="#org036c473">7. Redes</a>
<ul>
<li><a href="#org58fe49f">7.1. Firewall</a>
<ul>
<li><a href="#orgab5bdf4">7.1.1. Referencias</a></li>
</ul>
</li>
<li><a href="#org74577af">7.2. Pendiente</a></li>
</ul>
</li>
<li><a href="#org7c19630">8. Proxy Squid y Tor</a></li>
<li><a href="#org45fcb6c">9. Glosario</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgec0ce65" class="outline-2">
<h2 id="orgec0ce65"><span class="section-number-2">1</span> Virtualbox</h2>
<div class="outline-text-2" id="text-1">
<p>
Agregar a la guia actual
</p>
</div>

<div id="outline-container-orgab5b0af" class="outline-3">
<h3 id="orgab5b0af"><span class="section-number-3">1.1</span> 1. Instalacion de Virtualbox</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Nos aseguramos de instalar una version que se adapte a nuestro kernel
</p>

<div class="org-src-container">
<pre class="src src-sh"># La version que nos diga sera la que agregamos
mhwd-kernel -li
# Instalamos virtualbox (suponiendo que tu kernel es linux54)
sudo pacman -Syu virtualbox linux54-virtualbox-host-modules
# Cargamos virtualbox
sudo vboxreload
# Instalamos la version extendida que agrega nuevas funcionalidades
pamac build virtualbox-ext-oracle
# Agregamos el usuario actual al grupo de usuarios vbox
sudo gpasswd -a $USER vboxusers
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a25703" class="outline-3">
<h3 id="org6a25703"><span class="section-number-3">1.2</span> 2. Instalar Vagrant</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sh"># Instalamos vagrant
pacman -S vagrant
# Instalamos plugins 
# vagrant plugin install vagrant-vbguest vagrant-share
# creamos directorio donde instalar sl ervidor
mkdir manu-server 
cd manu-server 
# Inicializamos con una distribucion centos 7 como servidor linux
# vagrant box add centos-7.0-x86_64.box --name centos7

# vagrant init centos/7
vagrant init ubuntu/trusty64

# Descargamos e instalamos el servidor linux 
vagrant up 
# Nos conectamos al servidor
vagrant ssh
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Comando</td>
<td class="org-left">Descripcion</td>
</tr>

<tr>
<td class="org-left">:------</td>
<td class="org-left">:----------</td>
</tr>

<tr>
<td class="org-left">vagrant provision</td>
<td class="org-left">Instalar paquetes agregados en Vagrantfile</td>
</tr>

<tr>
<td class="org-left">vagrant halt</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">vagrant up</td>
<td class="org-left">Descargar e instalar un box</td>
</tr>

<tr>
<td class="org-left">vagrant ssh</td>
<td class="org-left">Conectarse al servidor</td>
</tr>

<tr>
<td class="org-left">vagrant init</td>
<td class="org-left">Inicializar</td>
</tr>
</tbody>
</table>


<p>
<b>Referencias</b>
</p>
<ul class="org-ul">
<li><a href="https://wiki.archlinux.org/index.php/Vagrant">https://wiki.archlinux.org/index.php/Vagrant</a></li>
<li><a href="https://www.vagrantup.com/docs/boxes/base.html">https://www.vagrantup.com/docs/boxes/base.html</a></li>
<li><a href="https://www.vagrantup.com/intro/getting-started/provisioning.html">https://www.vagrantup.com/intro/getting-started/provisioning.html</a></li>
<li><a href="https://dev.to/psnebc/vagrant-package-and-vagrant-box-add-8of">https://dev.to/psnebc/vagrant-package-and-vagrant-box-add-8of</a></li>
<li><a href="https://medium.com/@Joachim8675309/vagrant-provisioning-e4c9fd57968d">https://medium.com/@Joachim8675309/vagrant-provisioning-e4c9fd57968d</a></li>
<li><a href="https://scotch.io/courses/getting-started-with-vagrant-for-local-development/provisioning-vmprovision-how-to-customize-the-box">https://scotch.io/courses/getting-started-with-vagrant-for-local-development/provisioning-vmprovision-how-to-customize-the-box</a></li>
<li><a href="https://blog.ipswitch.com/installing-your-first-vagrant-box">https://blog.ipswitch.com/installing-your-first-vagrant-box</a></li>
<li><a href="https://computingforgeeks.com/how-to-addinstall-and-run-centos-7-vagrant-box-to-virtualbox-using-vagrant/">https://computingforgeeks.com/how-to-addinstall-and-run-centos-7-vagrant-box-to-virtualbox-using-vagrant/</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5940314" class="outline-3">
<h3 id="org5940314"><span class="section-number-3">1.3</span> 3. Configurar Servidor</h3>
<div class="outline-text-3" id="text-1-3">
<p>
En este caso usaremos ubuntu/trusty64
No tuve que crear particiones extra (chequear con blogs, y mas info por si acaso)
</p>

<p>
Compartir Carpetas
</p>
<ul class="org-ul">
<li><a href="https://blog.theodo.com/2017/07/speed-vagrant-synced-folders/">https://blog.theodo.com/2017/07/speed-vagrant-synced-folders/</a></li>
<li><a href="https://www.vagrantup.com/docs/synced-folders/basic_usage">https://www.vagrantup.com/docs/synced-folders/basic_usage</a></li>
<li><a href="https://stackoverflow.com/questions/19231895/how-to-share-a-folder-created-inside-vagrant">https://stackoverflow.com/questions/19231895/how-to-share-a-folder-created-inside-vagrant</a></li>
</ul>

<p>
Referencias
</p>
<ul class="org-ul">
<li><a href="https://www.2daygeek.com/how-to-resize-active-primary-root-partition-in-linux-using-gparted-utility/">https://www.2daygeek.com/how-to-resize-active-primary-root-partition-in-linux-using-gparted-utility/</a></li>
<li><a href="https://access.redhat.com/articles/1190213">https://access.redhat.com/articles/1190213</a></li>
<li><a href="https://kwilson.io/blog/format-a-linux-disk-as-ext4-from-the-command-line/">https://kwilson.io/blog/format-a-linux-disk-as-ext4-from-the-command-line/</a></li>
<li><a href="https://www.tecmint.com/create-new-ext4-file-system-partition-in-linux/">https://www.tecmint.com/create-new-ext4-file-system-partition-in-linux/</a></li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-org063bf40" class="outline-3">
<h3 id="org063bf40"><span class="section-number-3">1.4</span> 4. Configurar red</h3>
<div class="outline-text-3" id="text-1-4">
<p>
La idea es poder correr algun servidor web por ejemplo con prolog
y poder acceder via tu maquina
</p>

<ul class="org-ul">
<li><a href="https://www.oreilly.com/library/view/vagrant-up-and/9781449336103/ch04.html">https://www.oreilly.com/library/view/vagrant-up-and/9781449336103/ch04.html</a></li>
<li><a href="https://www.vagrantup.com/docs/networking/public_network.html">https://www.vagrantup.com/docs/networking/public_network.html</a></li>
<li><a href="https://stackoverflow.com/questions/33250304/how-to-automatically-select-bridged-network-interfaces-in-vagrant">https://stackoverflow.com/questions/33250304/how-to-automatically-select-bridged-network-interfaces-in-vagrant</a></li>
</ul>
</div>
</div>
