src/org-files/maquinas-virtuales.org
** Referencias
   - https://wiki.manjaro.org/index.php?title=VirtualBox
   - https://www.profesionalreview.com/2018/11/19/virtualbox-extension-pack/
   - https://www.hostinger.com.ar/tutoriales/centos-vs-ubuntu-elegir-servidor-web/
   - https://webtematica.com/centos-o-debian-para-servidores-web
   - https://www.sinologic.net/2011-02/porque-debian-no-centos.html
     
* Docker
** Conceptos
*** Imagen
    - Es como una plantilla que se usa de modelo para crear *contenedores*
    - Pueden crearse varios contenedores a partir de una imagen
    - No se pueden modificar
*** Contenedor
    - Se crean a partir de una imagen
    - Puede ser una aplicación, un sistema operativo, ...
** Instalación
   #+NAME: docker-instalacion-configuracion
   #+BEGIN_SRC sh
     # en manjaro
     sudo pacman -S docker
     # en ubuntu
     apt install docker

     # Create the docker group.
     sudo groupadd docker
     # Add your user to the docker group.
     sudo usermod -aG docker ${USER}
     # relogear ò reiniciar

     # verificamos si anda
     # descargando la imagen de hello-world
     docker run hello-world
   #+END_SRC

   #+NAME: docker-versionando-contenedor
   #+BEGIN_SRC sh
     # para listar los contenedores en ejecución
     docker ps

     # para correr o descargar && instalar una version ligera de linux con el tag 3.12
     # - Si ya teniamos la imagen de la distribución Alpine, se creará un nuevo contenedor
     # por cada vez que ejecutemos esta linea
     docker run alpine:3.12
     # podemos asignar un nombre a cada nuevo contenedor
     # - facilita tener varios contenedores de la misma distribución
     # - nos evitamos utilizar los ID de los contenedores, y usar solo el nombre
     docker run --name miLinux alpine:3.12

     # iniciar en modo "interactivo" en la terminal al contenedor alpine
     docker exec -it alpine:3.12 sh
     # si el contenedor tenia algun nombre
     docker exec -it miLinux sh
     # para listar archivos de la imagen
     # seguido al nombre del container y del tag, puedo mandarle comandos al container
     docker exec alpine:3.12 ls -l

     # muestra los containers instalados
     docker image ls | head
     # muestra los ultimos comandos de todos los containers (y su hash en la 1ra columna para versionar)
     docker ps -a | head

     # comitear un container (suponiendo que copiaste el hash al ejecutar "docker ps -a")
     docker commit elHashDelContainer
     # podemos verlo (copiamos el id)
     docker image ls | head
     # le asignamos un tag para diferenciar (suponiendo que asdasd123123 es el id)
     docker image tag asdasd123123 miPrimerDocker
   #+END_SRC

** Comandos básicos
   + El parámetro *ps* es como en linux normal, muestra los procesos en ejecución por tanto mostrará los containers activos (en ejecución)
