dist/maquinas-virtuales.html
<div id="outline-container-org97c6430" class="outline-3">
<h3 id="org97c6430"><span class="section-number-3">1.5</span> Referencias</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="https://wiki.manjaro.org/index.php?title=VirtualBox">https://wiki.manjaro.org/index.php?title=VirtualBox</a></li>
<li><a href="https://www.profesionalreview.com/2018/11/19/virtualbox-extension-pack/">https://www.profesionalreview.com/2018/11/19/virtualbox-extension-pack/</a></li>
<li><a href="https://www.hostinger.com.ar/tutoriales/centos-vs-ubuntu-elegir-servidor-web/">https://www.hostinger.com.ar/tutoriales/centos-vs-ubuntu-elegir-servidor-web/</a></li>
<li><a href="https://webtematica.com/centos-o-debian-para-servidores-web">https://webtematica.com/centos-o-debian-para-servidores-web</a></li>
<li><a href="https://www.sinologic.net/2011-02/porque-debian-no-centos.html">https://www.sinologic.net/2011-02/porque-debian-no-centos.html</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7515c08" class="outline-2">
<h2 id="org7515c08"><span class="section-number-2">2</span> Docker</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3d011ce" class="outline-3">
<h3 id="org3d011ce"><span class="section-number-3">2.1</span> Conceptos</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orga2664b4" class="outline-4">
<h4 id="orga2664b4"><span class="section-number-4">2.1.1</span> Imagen</h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>Es como una plantilla que se usa de modelo para crear <b>contenedores</b></li>
<li>Pueden crearse varios contenedores a partir de una imagen</li>
<li>No se pueden modificar</li>
</ul>
</div>
</div>
<div id="outline-container-org0639169" class="outline-4">
<h4 id="org0639169"><span class="section-number-4">2.1.2</span> Contenedor</h4>
<div class="outline-text-4" id="text-2-1-2">
<ul class="org-ul">
<li>Se crean a partir de una imagen</li>
<li>Puede ser una aplicación, un sistema operativo, …</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc82f4e5" class="outline-3">
<h3 id="orgc82f4e5"><span class="section-number-3">2.2</span> Instalación</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh" id="org21d1a4d"># en manjaro
sudo pacman -S docker
# en ubuntu
apt install docker

# Create the docker group.
sudo groupadd docker
# Add your user to the docker group.
sudo usermod -aG docker ${USER}
# relogear ò reiniciar

# verificamos si anda
# descargando la imagen de hello-world
docker run hello-world
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh" id="orgf54aaa0"># para listar los contenedores en ejecución
docker ps

# para correr o descargar &amp;&amp; instalar una version ligera de linux con el tag 3.12
# - Si ya teniamos la imagen de la distribución Alpine, se creará un nuevo contenedor
# por cada vez que ejecutemos esta linea
docker run alpine:3.12
# podemos asignar un nombre a cada nuevo contenedor
# - facilita tener varios contenedores de la misma distribución
# - nos evitamos utilizar los ID de los contenedores, y usar solo el nombre
docker run --name miLinux alpine:3.12

# iniciar en modo "interactivo" en la terminal al contenedor alpine
docker exec -it alpine:3.12 sh
# si el contenedor tenia algun nombre
docker exec -it miLinux sh
# para listar archivos de la imagen
# seguido al nombre del container y del tag, puedo mandarle comandos al container
docker exec alpine:3.12 ls -l

# muestra los containers instalados
docker image ls | head
# muestra los ultimos comandos de todos los containers (y su hash en la 1ra columna para versionar)
docker ps -a | head

# comitear un container (suponiendo que copiaste el hash al ejecutar "docker ps -a")
docker commit elHashDelContainer
# podemos verlo (copiamos el id)
docker image ls | head
# le asignamos un tag para diferenciar (suponiendo que asdasd123123 es el id)
docker image tag asdasd123123 miPrimerDocker
</pre>
</div>
</div>
</div>

<div id="outline-container-org7559a98" class="outline-3">
<h3 id="org7559a98"><span class="section-number-3">2.3</span> Comandos básicos</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>El parámetro <b>ps</b> es como en linux normal, muestra los procesos en ejecución por tanto mostrará los containers activos (en ejecución)</li>
</ul>
</div>
