dist/maquinas-virtuales.html
<div id="outline-container-orgfce7209" class="outline-4">
<h4 id="orgfce7209"><span class="section-number-4">2.3.1</span> Lista de Comandos</h4>
<div class="outline-text-4" id="text-2-3-1">
<table id="org4157dc1" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">docker start</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">docker stop</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">docker restart</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">docker images</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">docker run</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">docker exec</td>
<td class="org-left">&nbsp;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">docker search algunContainer</td>
<td class="org-left">Buscar un container</td>
</tr>

<tr>
<td class="org-left">docker images</td>
<td class="org-left">Listar containers ya instalados (entorno local)</td>
</tr>

<tr>
<td class="org-left">docker ps</td>
<td class="org-left">Listar containers en ejecución</td>
</tr>

<tr>
<td class="org-left">docker ps -a # -all</td>
<td class="org-left">Listar (all) todos los containers (activos/inactivos)</td>
</tr>

<tr>
<td class="org-left">docker ps -l # -list</td>
<td class="org-left">Listar (list) últimos containers creados</td>
</tr>

<tr>
<td class="org-left">docker restart IDdeAlgun</td>
<td class="org-left">Reiniciar un container (como si reiniciaras la maquina y sus servicios)</td>
</tr>

<tr>
<td class="org-left">docker start IDdeAlgunContainer</td>
<td class="org-left">Iniciar el Container como proceso(y sus servicios)</td>
</tr>

<tr>
<td class="org-left">docker stop IDdeAlgunContainer</td>
<td class="org-left">Detiene el Container como proceso(y sus servicios)</td>
</tr>

<tr>
<td class="org-left">docker exec IdDeAlgunContainer</td>
<td class="org-left">Ejecuta un comando en un container (NO CREA UNO NUEVO)</td>
</tr>

<tr>
<td class="org-left">docker run algunContainer algunComando</td>
<td class="org-left">Para ejecutar una linea comandos (y crea otro container)</td>
</tr>

<tr>
<td class="org-left">docker rm -f IDdeAlgunContainer</td>
<td class="org-left">Para eliminar un container</td>
</tr>

<tr>
<td class="org-left">docker rmi IDdeAlgunaImagen</td>
<td class="org-left">Para eliminar una imagen</td>
</tr>

<tr>
<td class="org-left">docker run -it algunContainer /bin/bash</td>
<td class="org-left">Modo interactivo (via terminal) (Y CREA OTRO CONTAINER)</td>
</tr>

<tr>
<td class="org-left">docker exec -it algunContainer /bin/bash</td>
<td class="org-left">Modo Interactivo (via terminal  (NO CREA UNO NUEVO)</td>
</tr>

<tr>
<td class="org-left">docker pull algunContainer</td>
<td class="org-left">Descargar o actualizarlo</td>
</tr>

<tr>
<td class="org-left">docker pull algunContainer:unTag</td>
<td class="org-left">El tag puede ser una version especifica</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">docker inspect IDdeAlgunContainer</td>
<td class="org-left">Da información COMPLETA en formato JSON</td>
</tr>

<tr>
<td class="org-left">docker rm $(docker ps -a -q)</td>
<td class="org-left">Remover todos los contenedores detenido</td>
</tr>

<tr>
<td class="org-left">docker rm $(docker images -q)</td>
<td class="org-left">Remover todas las imagenes</td>
</tr>

<tr>
<td class="org-left">docker kill $(docker ps -q)</td>
<td class="org-left">Mata el proceso de todos los contenedores en ejecución</td>
</tr>
</tbody>
</table>

<p>
Referencias:
</p>
<ol class="org-ol">
<li><a href="https://docs.docker.com/engine/reference/commandline/container_prune/">https://docs.docker.com/engine/reference/commandline/container_prune/</a></li>
<li><a href="https://hub.docker.com/repository/docker/neverkas/distroalpine">https://hub.docker.com/repository/docker/neverkas/distroalpine</a></li>
<li><a href="https://www.digitalocean.com/community/tutorials/como-instalar-y-usar-docker-en-ubuntu-18-04-1-es">https://www.digitalocean.com/community/tutorials/como-instalar-y-usar-docker-en-ubuntu-18-04-1-es</a></li>
<li><a href="https://www.ionos.es/digitalguide/servidores/configuracion/tutorial-docker-instalacion-y-primeros-pasos/">https://www.ionos.es/digitalguide/servidores/configuracion/tutorial-docker-instalacion-y-primeros-pasos/</a></li>
<li><a href="https://kubernetes.io/docs/tasks/configure-pod-container/pull-image-private-registry/">https://kubernetes.io/docs/tasks/configure-pod-container/pull-image-private-registry/</a></li>
<li><a href="https://linuxize.com/post/how-to-remove-docker-images-containers-volumes-and-networks/">https://linuxize.com/post/how-to-remove-docker-images-containers-volumes-and-networks/</a></li>
<li><a href="https://platzi.com/blog/desplegar-contenedores-docker/">Desplegar contenedores - platzi.com</a></li>
<li><a href="https://pandorafms.com/blog/es/docker-run/">Docker run - pandorafms.com</a></li>
</ol>
</div>
</div>

<div id="outline-container-org3f47acf" class="outline-4">
<h4 id="org3f47acf"><span class="section-number-4">2.3.2</span> Lista de parámetros</h4>
<div class="outline-text-4" id="text-2-3-2">
<table id="org4b5aae3" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Parametro</th>
<th scope="col" class="org-left">Forma Abreviada</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">detach</td>
<td class="org-left">d</td>
<td class="org-left">Correr contenedor en segundo plano</td>
</tr>

<tr>
<td class="org-left">tty</td>
<td class="org-left">t</td>
<td class="org-left">(tty) Asigna una pseudo terminal al proceso</td>
</tr>

<tr>
<td class="org-left">interactive</td>
<td class="org-left">i</td>
<td class="org-left">(STDIN) Mantiene el buffer de entrada abierto</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left">it</td>
<td class="org-left">Combinamos los parámetros para interactuar con con una pseudoterminal</td>
</tr>

<tr>
<td class="org-left">port</td>
<td class="org-left">p</td>
<td class="org-left">Abrir puertos del contenedor</td>
</tr>

<tr>
<td class="org-left">publish</td>
<td class="org-left">(?)</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">volume</td>
<td class="org-left">v</td>
<td class="org-left">(Volumenes) Compartir directorios en el contenedor</td>
</tr>

<tr>
<td class="org-left">mount</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">link</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">Enlaza un contenedor con otro (ideal para servidores web)</td>
</tr>

<tr>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
<td class="org-left">&nbsp;</td>
</tr>
</tbody>
</table>
</div>
</div>
