dist/maquinas-virtuales.html

<div id="outline-container-org0dfb0cb" class="outline-4">
<h4 id="org0dfb0cb"><span class="section-number-4">2.3.3</span> Observaciones importantes</h4>
<div class="outline-text-4" id="text-2-3-3">
<ul class="org-ul">
<li>Si queremos acceder al container (NO CREAR UNO NUEVO) usamos "docker exec -it IDdeAlgunaImagen bash" (si usamos run se creará un nuevo container)</li>
<li>Siempre se crea un contenedor distinto cuando ejecutas una imagen con "docker run -it IdAlgunaImagen bash"</li>
<li>Podemos usar el comando "docker run -it IDdeAlgunaImagen bash" para crear un nuevo contenedor</li>
<li>Si queremos guardar cambios de un container, podemos versionarlo comiteando y pusheando los cambios en algun repositorio</li>
</ul>

<pre class="example" id="docker-crear-imagen">Supongamos que tenemos un container de un ubuntu trusty (14.04) que ya tiene varios packages porque es el que usamos
(Ej. haskell, prolog, git, etc...) pero queremos probar un nuevo package o configuración
como sería instalar mysql, mongodb, etc.. sin que se vea afectado el que solemos usar.
Osea queremos uno de prueba, que sea idéntico al que usamos, donde instalemos cosas o probemos configuraciones del sistema operativo.

Entonces podemos correr el comando "docker run -it nombreImagen" para crear un nuevo container que tiene
lo mismo que al que apuntamos con el ID, si no funciona lo que queriamos instalar o no era
lo que necesitabamos borramos ese nuevo container y nos quedamos con el anterior

Observaciones:
Si estamos diciendo que esa imagen ya dispone de varios programas que nosotros instalamos,
es porque nosotros previamente hicimos un build de una imagen que disponga esos programas.
Para más información nos toca investigar sobre Dockerfile.
</pre>
</div>
</div>

<div id="outline-container-org8b9c0b3" class="outline-4">
<h4 id="org8b9c0b3"><span class="section-number-4">2.3.4</span> Crear Contenedores en primer y segundo plano</h4>
<div class="outline-text-4" id="text-2-3-4">
<ul class="org-ul">
<li>Para crear contenedores que corran en segundo plano pasamos el parámetro -d al comando <b>docker run</b></li>
<li>Para ejecutar contenedores que corran en segundo plano pasamos el parámetro -d al comando <b>docker exec</b></li>
</ul>

<blockquote id="docker-diferencias-primer-segundo-plano">
<p>
Al crear un contenedor en segundo plano, se ejecutará de fondo (osea por detrás de la terminal)
de donde ejecutemos el comando <b>docker run</b>, pudiendo seguir utilizando esa terminal donde lo ejecutamos.
(particularmente útil para correr servidores linux, base de datos, ….)
</p>

<p>
Si no lo creamos en segundo plano, nos aparecerá en la terminal el resultado de ejecutar el contenedor.
Si el contenedor era un servidor linux ó una base de datos, el ciclo de ciclo de vida del contenedor finalizará
luego de ejecutar el sevidor o la base de datos.
Sería como encenderlo, y luego apagarlo, sin poder darle uso. Teniendo que iniciar el contenedor nuevamente.
</p>

<p>
Es decir si creamos un contenedor en primer plano (no le pasamos el parámetro -d)
que ejecuta un comando ó tarea. Luego que esta tarea/comando se ejecutó, se detendrá la ejecución del contenedor.
Por tanto no podremos ejecutar otro comando, a menos que iniciemos el contenedor con el comando <b>docker start</b>
</p>
</blockquote>

<blockquote id="docker-diferencias-comandos-run-exec">
<p>
El comando <b>docker run</b> crea un contenedor que corra una tarea/comando 
El comando <b>docker exec</b> ejecuta en un contenedor ya existente una tarea/comando
</p>

<p>
Si queremos crear un contenedor que tenga una distribución de linux,
y podamos mandarle via terminal a ese linux comandos (ls, ps, …) 
ó acceder al linux con una pseudoterminal (modo interactivo)
</p>

<p>
debemos habilitar en el comando <b>docker run</b> el modo de "pseudoterminal" con el parámetro -t (hace referencia a tty)
para que luego podamos acceder con <b>docker exec</b> a la pseudoterminal de forma interactiva con el parámetro -i -t
ó solo enviarle comandos (sin usar -i -t)
</p>

<p>
Si usamos los parámetros -i -t en el comando <b>docker run</b>,
habilitará la terminal, ejecutará el comando que le pasemos y entrará en el contenedor de manera interactiva
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-sh" id="org4612f9e"># Creamos un contenedor con las siguientes características
# -El puerto 8000 habilitado, y podamos acceder a ese puerto desde nuestro ordenador desde puerto 80 (se redirecciona)
# -Con el nombre "miservidor"
# -Que sea un linux con la distribución Debian booster
# -Que podamos via terminal mandarles comandos (ls,ps,...), ó también acceder de manera interactiva
# -Que se ejecute en segundo plano

# Parámetros utilizados:
# - t: Habilita la pseudoterminal, para enviar comandos o acceder de manera interactiva
# - d: Corre el contenedor en segundo parámetro,
# -- name: le asignamos un nombre para usar de referencia
# - p puertoHost:puertoContenedor, abre un puerto para el contenedor
#  (el segundo puerto es el que usa el contenedor, y el primero el que usaremos fuera de docker en nuestro ordenador)
docker run --name miservidor -t -d -p 8000:80 debian:booster

# ejecutamos un comando para listar los directorios de miservidor
# sin necesidad de acceder al contenedor de manera interactiva (osea sin los parámetros -t -i)
docker exec miservidor ls

# accedemos al servidor de manera interactiva (parámetro -i) mediante una pseudoterminal (parámetro -t)
# Observaciones:
# - Según la distribución de linux, puede que en vez de escribir "bash" debas escribir "sh"
# - Para salir del contenedor utilizar el comando "exit"
docker exec -ti miservidor bash
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgf2a320d"></a>Referencias (de Issues)<br>
<div class="outline-text-5" id="text-2-3-4-1">
<ol class="org-ol">
<li><a href="https://mkyong.com/docker/docker-exec-bash-executable-file-not-found-in-path/">Docker -exec: Executable file not found - mkyong.com/docker</a></li>
<li><a href="https://stackoverflow.com/questions/29599632/docker-container-is-not-running/45270860#45270860">Docker Container is not running - stackoverflow.com</a></li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4b1a8b8" class="outline-4">
<h4 id="org4b1a8b8"><span class="section-number-4">2.3.5</span> Crear Imagenes</h4>
<div class="outline-text-4" id="text-2-3-5">
<blockquote id="docker-crear-imagenes">
<p>
Podemos crear una imagen de un servidor web que tenga por defecto algunos lenguajes de programación
como haskell, php, etc.. Ó que también tenga servicios de base de datos como sql, mysql, mongodb, etc..
y a partir de esas imagenes podemos crear contenedores.
</p>

<p>
Tiene como ventaja no tener que configurar manualmente ni tampoco instalar todos los paquetes uno por uno,
porque la imagen lo automatiza, y cada nuevo contenedor será idéntico.
</p>

<p>
Además podemos crear contenedores para probar nuevos paquetes, que desconocemos si pueden generar alguna falla
con el sistema operativo que tiene el contenedor.
</p>

<p>
Por tanto si algo fallara, sólo tendriamos que borrar el contenedor y crear uno nuevo a partir de la imagen base
de la que partimos para crear los contenedores.
</p>
</blockquote>
</div>

<ol class="org-ol">
<li><a id="orgb29fb3b"></a>Referencias<br>
<div class="outline-text-5" id="text-2-3-5-1">
<ol class="org-ol">
<li><a href="https://aulasoftwarelibre.github.io/taller-de-docker/dockerfile/">Crear imágenes propias - aulasoftwarelibre</a></li>
</ol>
</div>
</li>
</ol>
</div>
