src/org-files/maquinas-virtuales.org
*** Eliminar multiples Contenedores
    #+name: docker-eliminar-contenedores
    #+BEGIN_SRC sh
      # listamos los contenedores en ejecución
      docker ps
      # otra manera de listar los contenedores en ejecución
      docker container ls

      # listamos TODOS los contenedores (también los inactivos)
      docker ps -a
      # otra manera de listar TODOS los contenedores
      docker container ls -a

      # para detener todos los contenedores
      # - el parámetro -aq genera y devuelve un listado de contenedores
      docker container stop $(docker container ls -aq)

      # eliminamos uno o varios contenedores por id
      # (El id lo podemos conocer cuando listamos los contenedores, es la primera columna)
      docker container rm idDeUnContenedor idOtroContenedor

      # eliminamos todos los contenedores inactivos
      docker container prune

      # eliminamos contenedores por uno o varios criterios
      # - borrar los que fueron creados hace mas de 12 horas
      docker container prune --filter "until=12h"
    #+END_SRC
  
**** Referencias 
    1. [[https://phoenixnap.com/kb/remove-docker-images-containers-networks-volumes][Remove Docker images containers networks volumes - phoenix.com]]
*** Eliminar multiples imagenes
    Recordemos que para eliminar contenedores usamos el comando *rm*
    mientras que para remover imagenes es *rmi*

     #+name: docker-eliminar-imagenes
     #+BEGIN_SRC sh
      # listamos las imagenes para revisar el ID
      docker images ls
      # suponiendo que son varias imagenes se pueden agrupar en una linea
      docker rmi a23bb4013216 a341b4013200 a24bb422226
     #+END_SRC 
        
*** Descargar ó Actualizar un Contenedor
    #+name: docker-descargar-actualizar-contenedor
    #+BEGIN_SRC sh
      # para descargar una imagen ó actualizar un container local ya existente
      # el uso de tag es opcional
      docker pull nombreAlgunContainer:tag

      # usamos los tags para descargar ó actualizar a una versión específica
      # sino especificamos, nos suele traer por defecto la última vesión (latest)

      # usamos de tag el número de la versión
      docker pull ubuntu:14.04 # es la distribución trusty de ubuntu
      docker pull debian:10 # es la distribución buster de debian

      # usamos de tag el nombre de la versión
      docker pull ubuntu:trusty # 14.x
      docker pull debian:buster # 10.x
    #+END_SRC

*** Listar contenedores en ejecución e inactivos
    #+name: docker-listar-contenedores 
     #+BEGIN_SRC sh
      # listar containers en ejecución
      docker ps
      # -l se refiere a "list"
      docker ps -l # tiene el mismo resultado que no pasarle el parámetro -l

      # lista todos los containers (los inactivos también)
      # -a se refiere a "all"
      docker ps -a
     #+END_SRC
       
*** Acceder ó Iniciar/Detener ejecución de contenedores
    - Iniciamos el contenedor ejecutando en la terminal *docker start*
    - Detenemos la ejecución con *docker stop*
    
    #+name: docker-ejemplo1-iniciar-contenedor
    #+BEGIN_EXAMPLE
    Si al crear el contenedor mediante *docker run*
    no le pasamos el parámetro -it, entonces no podremos acceder por terminal
    mediante este otro comando *docker exec -it IDdeAlgunContenedor bash*

    Porque el comando *run* como dice su nombre, ejecuta un comando cuando se inicie el contenedor
    si no le decimos que lo haga con el modo interactivo mediante una pseudoterminal (parámetros -i y -t)
    tampoco lo hará cuando se lo pasemos al comando *exec*
    #+END_EXAMPLE
   
    #+name: docker-ejemplo2-iniciar-contenedor
    #+BEGIN_EXAMPLE
    Usando de referencia el ejemplo1, una vez que salgamos del modo interactivo con la pseudoterminal
    el contenedor se detendrá, y deberemos de iniciarlo nuevamente. 

    Si no queremos estar iniciando a cada rato el contenedor
    podemos adicionar el parámetro -d para ejecutarlo en un segundo plano
    
    Observación:
    Tenenemos un apartado que detalle un poco más sobre el parámetro d,
    esto es solo a modo de aclaración, de que se detendrá el contenedor una vez que salgamos del modo interactivo.
    #+END_EXAMPLE
    
    #+name: docker-iniciar-detener-contenedor
    #+BEGIN_SRC sh
      # iniciar un container
      # se le puede pasar el nombre, o el ID
      # docker start nombreContainer
      # docker start idContainer
      docker start miUbuntu

      # detener un container en ejecución
      # docker stop nombreContainer
      # docker stop idContainer
      docker stop miDebian

      # entrar al modo interactivo via terminal
      # docker exec -it nombreContainer
      # docker exec -it idContainer
      docker exec -it alpine sh

      # Según la distribución de Linux puede que la ruta /bin/bash no aparezca
      # docker exec -it algunContainer sh
      # docker exec -it algunContainer /bin/bash
      docker exec -it ubuntu bin/bash
    #+END_SRC

*** Versionar containers
     + Suponiendo que ya habiamos creado en la página de *dockerhub* un repositorio llamado *distroalpine*

**** 1. Creamos un tag a nuestro container local
     #+name: docker-crear-tag
     #+BEGIN_SRC sh
       docker tag a24bb4013296 neverkas/distroalpine:3.12

       # los datos que aparecen son
       # - usuario (dueño) del repositorio: neverkas
       # - nombre del repositorio: distroalpine
       # - tag (version en este caso): 3.12
     #+END_SRC

**** 2. Subimos los cambios
     #+name: docker-push 
     #+BEGIN_SRC sh
       docker push neverkas/distroalpine:3.12

       # los datos que aparecen son
       # - usuario (dueño) del repositorio: neverkas
       # - nombre del repositorio: distroalpine
       # - tag (version en este caso): 3.12
     #+END_SRC


     docker tag local-image:tagname new-repo:tagname
     docker push new-repo:tagname
*** Abrir Puertos
    Usamos el parámetro -p
*** Referencias Web
    1. [[https://es.linux-console.net/?p=1181][Contenedor en segundo plano - linux-console.com]]
** Estados
   |--------+--------------|
   | Estado | Descripcion  |
   |--------+--------------|
   | exited | Inactivo     |
   | up     | En ejecución |
   |--------+--------------|
** Probando
