dist/maquinas-virtuales.html
<div id="outline-container-orgdcae032" class="outline-4">
<h4 id="orgdcae032"><span class="section-number-4">2.3.6</span> Eliminar multiples Contenedores</h4>
<div class="outline-text-4" id="text-2-3-6">
<div class="org-src-container">
<pre class="src src-sh" id="org2b41269"># listamos los contenedores en ejecución
docker ps
# otra manera de listar los contenedores en ejecución
docker container ls

# listamos TODOS los contenedores (también los inactivos)
docker ps -a
# otra manera de listar TODOS los contenedores
docker container ls -a

# para detener todos los contenedores
# - el parámetro -aq genera y devuelve un listado de contenedores
docker container stop $(docker container ls -aq)

# eliminamos uno o varios contenedores por id
# (El id lo podemos conocer cuando listamos los contenedores, es la primera columna)
docker container rm idDeUnContenedor idOtroContenedor

# eliminamos todos los contenedores inactivos
docker container prune

# eliminamos contenedores por uno o varios criterios
# - borrar los que fueron creados hace mas de 12 horas
docker container prune --filter "until=12h"
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgc12657b"></a>Referencias<br>
<div class="outline-text-5" id="text-2-3-6-1">
<ol class="org-ol">
<li><a href="https://phoenixnap.com/kb/remove-docker-images-containers-networks-volumes">Remove Docker images containers networks volumes - phoenix.com</a></li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org753515e" class="outline-4">
<h4 id="org753515e"><span class="section-number-4">2.3.7</span> Eliminar multiples imagenes</h4>
<div class="outline-text-4" id="text-2-3-7">
<p>
Recordemos que para eliminar contenedores usamos el comando <b>rm</b>
mientras que para remover imagenes es <b>rmi</b>
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org86f953a"># listamos las imagenes para revisar el ID
docker images ls
# suponiendo que son varias imagenes se pueden agrupar en una linea
docker rmi a23bb4013216 a341b4013200 a24bb422226
</pre>
</div>
</div>
</div>

<div id="outline-container-org94158a6" class="outline-4">
<h4 id="org94158a6"><span class="section-number-4">2.3.8</span> Descargar ó Actualizar un Contenedor</h4>
<div class="outline-text-4" id="text-2-3-8">
<div class="org-src-container">
<pre class="src src-sh" id="orgb6dacf7"># para descargar una imagen ó actualizar un container local ya existente
# el uso de tag es opcional
docker pull nombreAlgunContainer:tag

# usamos los tags para descargar ó actualizar a una versión específica
# sino especificamos, nos suele traer por defecto la última vesión (latest)

# usamos de tag el número de la versión
docker pull ubuntu:14.04 # es la distribución trusty de ubuntu
docker pull debian:10 # es la distribución buster de debian

# usamos de tag el nombre de la versión
docker pull ubuntu:trusty # 14.x
docker pull debian:buster # 10.x
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb023564" class="outline-4">
<h4 id="orgb023564"><span class="section-number-4">2.3.9</span> Listar contenedores en ejecución e inactivos</h4>
<div class="outline-text-4" id="text-2-3-9">
<div class="org-src-container">
<pre class="src src-sh" id="orgac9c44c"># listar containers en ejecución
docker ps
# -l se refiere a "list"
docker ps -l # tiene el mismo resultado que no pasarle el parámetro -l

# lista todos los containers (los inactivos también)
# -a se refiere a "all"
docker ps -a
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab33918" class="outline-4">
<h4 id="orgab33918"><span class="section-number-4">2.3.10</span> Acceder ó Iniciar/Detener ejecución de contenedores</h4>
<div class="outline-text-4" id="text-2-3-10">
<ul class="org-ul">
<li>Iniciamos el contenedor ejecutando en la terminal <b>docker start</b></li>
<li>Detenemos la ejecución con <b>docker stop</b></li>
</ul>

<pre class="example" id="docker-ejemplo1-iniciar-contenedor">Si al crear el contenedor mediante *docker run*
no le pasamos el parámetro -it, entonces no podremos acceder por terminal
mediante este otro comando *docker exec -it IDdeAlgunContenedor bash*

Porque el comando *run* como dice su nombre, ejecuta un comando cuando se inicie el contenedor
si no le decimos que lo haga con el modo interactivo mediante una pseudoterminal (parámetros -i y -t)
tampoco lo hará cuando se lo pasemos al comando *exec*
</pre>

<pre class="example" id="docker-ejemplo2-iniciar-contenedor">Usando de referencia el ejemplo1, una vez que salgamos del modo interactivo con la pseudoterminal
el contenedor se detendrá, y deberemos de iniciarlo nuevamente. 

Si no queremos estar iniciando a cada rato el contenedor
podemos adicionar el parámetro -d para ejecutarlo en un segundo plano

Observación:
Tenenemos un apartado que detalle un poco más sobre el parámetro d,
esto es solo a modo de aclaración, de que se detendrá el contenedor una vez que salgamos del modo interactivo.
</pre>

<div class="org-src-container">
<pre class="src src-sh" id="org3694abb"># iniciar un container
# se le puede pasar el nombre, o el ID
# docker start nombreContainer
# docker start idContainer
docker start miUbuntu

# detener un container en ejecución
# docker stop nombreContainer
# docker stop idContainer
docker stop miDebian

# entrar al modo interactivo via terminal
# docker exec -it nombreContainer
# docker exec -it idContainer
docker exec -it alpine sh

# Según la distribución de Linux puede que la ruta /bin/bash no aparezca
# docker exec -it algunContainer sh
# docker exec -it algunContainer /bin/bash
docker exec -it ubuntu bin/bash
</pre>
</div>
</div>
</div>

<div id="outline-container-org6fb5c7e" class="outline-4">
<h4 id="org6fb5c7e"><span class="section-number-4">2.3.11</span> Versionar containers</h4>
<div class="outline-text-4" id="text-2-3-11">
<ul class="org-ul">
<li>Suponiendo que ya habiamos creado en la página de <b>dockerhub</b> un repositorio llamado <b>distroalpine</b></li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org1d63fba"></a>1. Creamos un tag a nuestro container local<br>
<div class="outline-text-5" id="text-2-3-11-1">
<div class="org-src-container">
<pre class="src src-sh" id="orgc076499">docker tag a24bb4013296 neverkas/distroalpine:3.12

# los datos que aparecen son
# - usuario (dueño) del repositorio: neverkas
# - nombre del repositorio: distroalpine
# - tag (version en este caso): 3.12
</pre>
</div>
</div>
</li>

<li><a id="org90269e0"></a>2. Subimos los cambios<br>
<div class="outline-text-5" id="text-2-3-11-2">
<div class="org-src-container">
<pre class="src src-sh" id="orgd2f2a7a">docker push neverkas/distroalpine:3.12

# los datos que aparecen son
# - usuario (dueño) del repositorio: neverkas
# - nombre del repositorio: distroalpine
# - tag (version en este caso): 3.12
</pre>
</div>


<p>
docker tag local-image:tagname new-repo:tagname
docker push new-repo:tagname
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org40e7e1d" class="outline-4">
<h4 id="org40e7e1d"><span class="section-number-4">2.3.12</span> Abrir Puertos</h4>
<div class="outline-text-4" id="text-2-3-12">
<p>
Usamos el parámetro -p
</p>
</div>
</div>
<div id="outline-container-orge4e91e4" class="outline-4">
<h4 id="orge4e91e4"><span class="section-number-4">2.3.13</span> Referencias Web</h4>
<div class="outline-text-4" id="text-2-3-13">
<ol class="org-ol">
<li><a href="https://es.linux-console.net/?p=1181">Contenedor en segundo plano - linux-console.com</a></li>
</ol>
</div>
</div>
</div>
