src/org-files/maquinas-virtuales.org
*** Probando Alpine (Linux)

    #+BEGIN_SRC sh
       # https://www.emacswiki.org/emacs/Evil
       # https://orgmode.org/manual/Installation.html

       # corremos el container la version 3.12 (el tag)
       # si no existe lo descarga
       docker run alpine:3.12
       # instalar git
       apk add git
       # instalar emacs
       apk add emacs
       # 1. listar packages (entrar al emacs)
       # M-x packages-list
       # 2. instalar org mode (entrar a emacs )
       # M-x package-install RET org RET
       # 3. instalar evil mode (tratè con el list-packages pero no aparecìa)
       git clone https://github.com/emacs-evil/evil.git
       mv evil ~/emacs.d/

       # descargar el theme dark dracula
       https://github.com/dracula/emacs.git
       mv /emacs/dracula-theme.el ~/emacs.d/themes/dracula-theme.el
    #+END_SRC

    Agregar lo sig al ~/.emacs para activar el vim mod y el theme dark dracula
    #+BEGIN_SRC emacs-lisp
      ; con esto agregamos el modo vim
      (add-to-list 'load-path "~/.emacs.d/evil")
      (require 'evil)
      (evil-mode 1)

      ; cargamos el theme dracula dark
      (add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
      (load-theme 'dracula t)
    #+END_SRC
   
*** Probando Debian (Linux)
     #+BEGIN_SRC sh
       # 1. Descargamos el OS Debian
       # - Si ya lo teniamos lo actualizará
       # - Seguido de los dos puntos se puede escribir o no una etiqueta/tag
       # para especificar una distribución ó versión ó característica
       docker run debian:buster

       # 2. Accedemos al container
       # - el parámetro "i" hace referencia a "Modo Interactivo"
       # - el parámetro "t" hace referencia a "tty" una pseudo-terminal
       # osea interactuar de forma directa con el SO, via terminal y ejecutar instrucciones
       docker run -it debian:buster /bin/bash
     #+END_SRC
*** Actualmente en uso
    Por ahora utilizo ubuntu trusty que sería la versión 14.04 que es bastante liviana
    
    #+BEGIN_SRC sh
      # entramos a la terminal (se creará un nuevo contenedor "distinto" cada vez que ejecutamos este comando)
      # docker run -it ubuntu:trusty bin/bash

      # descargamos la distribución ubuntu versión trusty (14.04)
      docker pull ubuntu:trusty

      # creamos una carpeta en nuestro HOST y la compartimos
      mkdir ~/Docker
      # Hacemos un punto de montaje
      # 1.Para asignar el nombre al contenedor usamos --name
      # 2.Para referirnos al volumen usamos -v
      # 3.La ruta (debe ser absoluta agregando ~) del HOST a compartir será ~/Docker
      #   (si no es absoluta, se creará un volumen que se comparte entre los demás containers, a docker volume)
      # 4.La nueva ruta que se creará en el Container /opt/share
      # 5.La imagen a utilizar es ubuntu:trusty
      # 6.En la bash shell
      # docker run -v ~/Docker:/opt/share -it ubuntu:trusty /bin/bash
      docker run -it --name test1 -v ~/Docker:/opt/share ubuntu:trusty bash

      # IMPORTANTE:
      # Recorda que cada vez que ejecutes "run" se creará un nuevo contenedor
      # en este caso se montará un punto de montaje entre Host/Un nuevo Contenedor llamado "test1"
      # cada vez que quieras hacer cambios en ese "contenedor"
      # acceder con docker exec -it test /bin/bash

      # comprobamos
      docker ps -a | grep test1
      # iniciamos el proceso del container
      docker start test1
      # corremos el comando "modo interactivo" en el container "test1" y accedemos a la bash shell
      # (si usamos run, se creará un nuevo contenedor, la idea es utilizar este y no se creará otro)
      docker exec -it test1 /bin/bash

      apt-get update
      apt-get install swi-prolog -y

      # versionamos para guardar el estado del container
      docker ps -a # para revisar el id del container
      docker commit 5b13ee15d1f1 neverkas/ubuntu-trusty # suponiendo que ese es el ID
      docker push neverkas/ubuntu-trusty

      # revisamos el nuevo contenedor
      docker ps -a

      # salimos del contenedor
      exit
      # si queremos revisar la version de prolog instalada sin entrar al container
      docker exec test1 swipl -v
      # si queremos acceder al container y ejecutar prolog
      docker exec -it test1 swipl
      exit # salimos
      # si queremos acceder solo como en la bash shell
      docker exec -it test1 /bin/bash


      # IMPORTANTE:
      # - Al hacer commit se creará una nueva imagen, que apunta al repositorio publico "neverkas/ubuntu-trusty"
      # el usuario seria neverkas (LA PRIMERA VEZ, LAS PROXIMAS APUNTARAN SIEMPRE AL MISMO CONTAINER)
      # seguido del nombre de container que se guardará como local (sería una imagen)


    #+END_SRC

*** Ubuntu
    Cada versión de la distribución lleva un nombre distinto

    |---------+--------|
    | Version | Nombre |
    |---------+--------|
    |   14.04 | Trusty |
    |   16.04 | Xenial |
    |   18.04 | Bionic |
    |---------+--------|

    *Referencias*
    + [[https://releases.ubuntu.com/][Ubuntu releases - ubuntu.com]]
    + [[https://hub.docker.com/_/ubuntu?tab=tags][Ubuntu Tags - hub.docker.com]]
    + [[https://wwu-pi.github.io/tutorials/lectures/lsp/010_install_swi_prolog.html][Installing SWI-Prolog - pi-github.io]]
** Configurando Puertos
** Configurando Volumenes
*** Conceptos
    Los volumenes por defecto se crean en la ruta /var/lib/docker/volumes
*** Ejemplos
    #+BEGIN_SRC sh
      # creamos un nuevo volumen
      # /datos es una ruta nuestro ordenador
      # /www es una ruta que está dentro del contenedor
      docker run -it -v /datos:/www/ --name mi-server alpine:latest sh
    #+END_SRC
*** Referencias    
    1. https://www.youtube.com/watch?v=GfL_Ltu-eyw
** Configurando Redes Docker
*** Conceptos
*** Crear Red
    #+BEGIN_SRC sh
      docker network create mi-red
      # crea una red con un rango 
      docker network create --subnet=192.168.0.0/16 mi-red2

      nmcli con
      ip a | more
      docker inspect mi-red > mi-red.txt
    #+END_SRC
*** Referencias
