dist/maquinas-virtuales.html
<div id="outline-container-orge6f189a" class="outline-3">
<h3 id="orge6f189a"><span class="section-number-3">2.4</span> Estados</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Estado</th>
<th scope="col" class="org-left">Descripcion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">exited</td>
<td class="org-left">Inactivo</td>
</tr>

<tr>
<td class="org-left">up</td>
<td class="org-left">En ejecución</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgaefc54e" class="outline-3">
<h3 id="orgaefc54e"><span class="section-number-3">2.5</span> Probando</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org78922da" class="outline-4">
<h4 id="org78922da"><span class="section-number-4">2.5.1</span> Probando Alpine (Linux)</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-sh"># https://www.emacswiki.org/emacs/Evil
# https://orgmode.org/manual/Installation.html

# corremos el container la version 3.12 (el tag)
# si no existe lo descarga
docker run alpine:3.12
# instalar git
apk add git
# instalar emacs
apk add emacs
# 1. listar packages (entrar al emacs)
# M-x packages-list
# 2. instalar org mode (entrar a emacs )
# M-x package-install RET org RET
# 3. instalar evil mode (tratè con el list-packages pero no aparecìa)
git clone https://github.com/emacs-evil/evil.git
mv evil ~/emacs.d/

# descargar el theme dark dracula
https://github.com/dracula/emacs.git
mv /emacs/dracula-theme.el ~/emacs.d/themes/dracula-theme.el
</pre>
</div>

<p>
Agregar lo sig al ~/.emacs para activar el vim mod y el theme dark dracula
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">; con esto agregamos el modo vim
(add-to-list 'load-path "~/.emacs.d/evil")
(require 'evil)
(evil-mode 1)

; cargamos el theme dracula dark
(add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
(load-theme 'dracula t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7627fd0" class="outline-4">
<h4 id="org7627fd0"><span class="section-number-4">2.5.2</span> Probando Debian (Linux)</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-sh"># 1. Descargamos el OS Debian
# - Si ya lo teniamos lo actualizará
# - Seguido de los dos puntos se puede escribir o no una etiqueta/tag
# para especificar una distribución ó versión ó característica
docker run debian:buster

# 2. Accedemos al container
# - el parámetro "i" hace referencia a "Modo Interactivo"
# - el parámetro "t" hace referencia a "tty" una pseudo-terminal
# osea interactuar de forma directa con el SO, via terminal y ejecutar instrucciones
docker run -it debian:buster /bin/bash
</pre>
</div>
</div>
</div>
<div id="outline-container-orge15e171" class="outline-4">
<h4 id="orge15e171"><span class="section-number-4">2.5.3</span> Actualmente en uso</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
Por ahora utilizo ubuntu trusty que sería la versión 14.04 que es bastante liviana
</p>

<div class="org-src-container">
<pre class="src src-sh"># entramos a la terminal (se creará un nuevo contenedor "distinto" cada vez que ejecutamos este comando)
# docker run -it ubuntu:trusty bin/bash

# descargamos la distribución ubuntu versión trusty (14.04)
docker pull ubuntu:trusty

# creamos una carpeta en nuestro HOST y la compartimos
mkdir ~/Docker
# Hacemos un punto de montaje
# 1.Para asignar el nombre al contenedor usamos --name
# 2.Para referirnos al volumen usamos -v
# 3.La ruta (debe ser absoluta agregando ~) del HOST a compartir será ~/Docker
#   (si no es absoluta, se creará un volumen que se comparte entre los demás containers, a docker volume)
# 4.La nueva ruta que se creará en el Container /opt/share
# 5.La imagen a utilizar es ubuntu:trusty
# 6.En la bash shell
# docker run -v ~/Docker:/opt/share -it ubuntu:trusty /bin/bash
docker run -it --name test1 -v ~/Docker:/opt/share ubuntu:trusty bash

# IMPORTANTE:
# Recorda que cada vez que ejecutes "run" se creará un nuevo contenedor
# en este caso se montará un punto de montaje entre Host/Un nuevo Contenedor llamado "test1"
# cada vez que quieras hacer cambios en ese "contenedor"
# acceder con docker exec -it test /bin/bash

# comprobamos
docker ps -a | grep test1
# iniciamos el proceso del container
docker start test1
# corremos el comando "modo interactivo" en el container "test1" y accedemos a la bash shell
# (si usamos run, se creará un nuevo contenedor, la idea es utilizar este y no se creará otro)
docker exec -it test1 /bin/bash

apt-get update
apt-get install swi-prolog -y

# versionamos para guardar el estado del container
docker ps -a # para revisar el id del container
docker commit 5b13ee15d1f1 neverkas/ubuntu-trusty # suponiendo que ese es el ID
docker push neverkas/ubuntu-trusty

# revisamos el nuevo contenedor
docker ps -a

# salimos del contenedor
exit
# si queremos revisar la version de prolog instalada sin entrar al container
docker exec test1 swipl -v
# si queremos acceder al container y ejecutar prolog
docker exec -it test1 swipl
exit # salimos
# si queremos acceder solo como en la bash shell
docker exec -it test1 /bin/bash


# IMPORTANTE:
# - Al hacer commit se creará una nueva imagen, que apunta al repositorio publico "neverkas/ubuntu-trusty"
# el usuario seria neverkas (LA PRIMERA VEZ, LAS PROXIMAS APUNTARAN SIEMPRE AL MISMO CONTAINER)
# seguido del nombre de container que se guardará como local (sería una imagen)


</pre>
</div>
</div>
</div>

<div id="outline-container-orgeafa8c6" class="outline-4">
<h4 id="orgeafa8c6"><span class="section-number-4">2.5.4</span> Ubuntu</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
Cada versión de la distribución lleva un nombre distinto
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-right">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Version</th>
<th scope="col" class="org-left">Nombre</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">14.04</td>
<td class="org-left">Trusty</td>
</tr>

<tr>
<td class="org-right">16.04</td>
<td class="org-left">Xenial</td>
</tr>

<tr>
<td class="org-right">18.04</td>
<td class="org-left">Bionic</td>
</tr>
</tbody>
</table>

<p>
<b>Referencias</b>
</p>
<ul class="org-ul">
<li><a href="https://releases.ubuntu.com/">Ubuntu releases - ubuntu.com</a></li>
<li><a href="https://hub.docker.com/_/ubuntu?tab=tags">Ubuntu Tags - hub.docker.com</a></li>
<li><a href="https://wwu-pi.github.io/tutorials/lectures/lsp/010_install_swi_prolog.html">Installing SWI-Prolog - pi-github.io</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org35b333e" class="outline-3">
<h3 id="org35b333e"><span class="section-number-3">2.6</span> Configurando Puertos</h3>
</div>
<div id="outline-container-org2d2b3e7" class="outline-3">
<h3 id="org2d2b3e7"><span class="section-number-3">2.7</span> Configurando Volumenes</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org6fadfe9" class="outline-4">
<h4 id="org6fadfe9"><span class="section-number-4">2.7.1</span> Conceptos</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
Los volumenes por defecto se crean en la ruta /var/lib/docker/volumes
</p>
</div>
</div>
<div id="outline-container-orgfbb2f71" class="outline-4">
<h4 id="orgfbb2f71"><span class="section-number-4">2.7.2</span> Ejemplos</h4>
<div class="outline-text-4" id="text-2-7-2">
<div class="org-src-container">
<pre class="src src-sh"># creamos un nuevo volumen
# /datos es una ruta nuestro ordenador
# /www es una ruta que está dentro del contenedor
docker run -it -v /datos:/www/ --name mi-server alpine:latest sh
</pre>
</div>
</div>
</div>
<div id="outline-container-org336f743" class="outline-4">
<h4 id="org336f743"><span class="section-number-4">2.7.3</span> Referencias</h4>
<div class="outline-text-4" id="text-2-7-3">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=GfL_Ltu-eyw">https://www.youtube.com/watch?v=GfL_Ltu-eyw</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge448cc0" class="outline-3">
<h3 id="orge448cc0"><span class="section-number-3">2.8</span> Configurando Redes Docker</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-org7498633" class="outline-4">
<h4 id="org7498633"><span class="section-number-4">2.8.1</span> Conceptos</h4>
</div>
<div id="outline-container-orgecfc838" class="outline-4">
<h4 id="orgecfc838"><span class="section-number-4">2.8.2</span> Crear Red</h4>
<div class="outline-text-4" id="text-2-8-2">
<div class="org-src-container">
<pre class="src src-sh">docker network create mi-red
# crea una red con un rango 
docker network create --subnet=192.168.0.0/16 mi-red2

nmcli con
ip a | more
docker inspect mi-red &gt; mi-red.txt
</pre>
</div>
</div>
</div>
