src/org-files/maquinas-virtuales.org
** Ejemplos

   #+BEGIN_SRC sh
     # Creamos una red para conectar el contenedor
     docker network create --driver=bridge red-jelou

     # creamos el contenedor llamado prueba1 que tenga linux alpine edge
     # montamos un volumen llamado datos-jelou que usará
     # le asignamos la red que creamos previamente
     # y que ejecute el comando "sh" al iniciar (caso contrario no podemos acceder)
     docker run --name=prueba1 -it -v datos-jelou:/opt --network=red-jelou alpine:edge sh

     # analizamos el punto de montaje, osea donde se creó el volumen en el Host
     # - el volumen se puede compartir entre otros contenedores
     docker volume inspect datos-jelou

     # analizamos la red,
     # que otros contenedores la utilizan
     docker network red-jelou

   #+END_SRC
   
   #+BEGIN_QUOTE
   run
   #   crea un contenedor

   -it
   # habilita una pseudo terminal para acceder al contenedor

   -v jelou:/opt
   #   Monta un volumen que apunta a la ruta /opt del contenedor
   #   si ya existe solo le asigna ese volumen al contenedor
   #   Se puede compartir el volumen entre otros contenedores

   --network=red-jelou
   #   Utiliza una red llamada red-jelou (previamente hay que crearla)

   alpine:edge
   #   Elegimos la distribución Alpine de Linux
   #   y especificamos que sea la versión "Edge"
   #+END_QUOTE
** Referencias
   + [[https://docs.docker.com/develop/develop-images/dockerfile_best-practices/][Best practices for writing Dockerfiles - docs.docker.com]]
   + https://docs.docker.com/engine/reference/commandline/container_prune/
   + [[https://github.com/rocker-org/rocker/wiki/How-to-save-data][How to save data - github.com/rocker-org]]
   + [[https://www.digitalocean.com/community/tutorials/como-instalar-y-usar-docker-en-ubuntu-18-04-1-es][Como instalar y usar Docker en Ubuntu 18.04 - Digitalocean.com]]
   + [[https://www.ionos.es/digitalguide/servidores/configuracion/tutorial-docker-instalacion-y-primeros-pasos/][Tutorial Docker - Instalación y primeros pasos - Ionos.es]]
   + [[https://colorfield.be/blog/cleaning-lando-containers][Cleaning up containers - colorfield.de]]
   + [[https://blog.hipolabs.com/understanding-docker-without-losing-your-shit-cf2b30307c63][Understanding Docker - Blog hipolabs]]
   + [[https://docs.docker.com/engine/reference/commandline/commit/][Docker commit - Docker.com]]

   + [[https://www.youtube.com/watch?v=PbiYll21Jxg&list=PLZdsdjcJ44WU_cY2Y1LFLnmsSjFD5BZLZ][Playlist - DOcker container course (el mejor por ahora)]]
   + [[https://www.youtube.com/watch?v=vjnOIE-CwMU&list=PLqRCtm0kbeHAep1hc7yW-EZQoAJqSTgD-&index=2][Video - DOcker - primeros pasos]]
   + [[https://www.youtube.com/watch?v=6idFknRIOp4&t=201s][Video - Aprender docker en 14min]]

   + https://stackoverflow.com/questions/21871479/docker-cant-connect-to-docker-daemon
   + https://www.digitalocean.com/community/questions/how-to-fix-docker-got-permission-denied-while-trying-to-connect-to-the-docker-daemon-socket
   + https://manjaro.site/how-to-install-docker-on-manjaro-18-0/

** Referencias - Videos
   1. [[https://www.youtube.com/watch?v=r6bxsuDq6wY&list=PLmBbXLdrZ-O3B3rsLOVHufTL_wmickgLf&ab_channel=ServersforHackers][Playlist #1]]
   2. [[https://www.youtube.com/watch?v=jjuIEHhXX7k&list=PLmBbXLdrZ-O0GxzRkPdY6zUe9XRYNt38A&ab_channel=ServersforHackers][Playlist #2]]
* Dockerfile
** Conceptos
** Comandos básicos
*** (BUILD) Crear Imagen
    La idea del dockerfile es crear imagenes, para luego crear contenedores

    #+NAME: Crear imagen
    #+BEGIN_SRC sh
      # usamos el comando build
      # seguido del parámetro -t
      # seguido de la imagen y un tag que especifique la versión (opcional)
      # por último la ruta donde está el Dockerfile, si se deja el punto se refiere a la ruta actual
      docker build -t nombreImagen:algunTag .
    #+END_SRC
*** (COPY) Copiar archivos
    - A diferencia del comando *ADD* no descomprime los archivos (Ej. .jar, .gz,..) que quizás no es la intención, 
    y los mueve a la ruta destino.

    #+NAME: docker-comando-copy
    #+BEGIN_SRC sh
      FROM debian

      # resources/app.jar es una ruta que pertenece al host, son los archivos y directorios que queremos copiar
      # /app es una ruta que está dentro del contenedor de docker, es donde se copiarán los archivos
      COPY resources/app.jar /app

      # este comando se ejecuta al iniciar el contenedor
      # y ejecuta el archivo .jar que copiamos al contenedor
      CMD ["java", "-jar", "app/app.jar"]
    #+END_SRC
*** (ADD) Descargar y Descomprimir archivos
    - Puede descargar archivos de url de internet y agregarlos a una ruta del contenedor
    - Permite descomprimir archivos (comportamiento quizás no deseado si se confunde con el comando *COPY*) 

    #+NAME: dockerfile-comando-add
    #+BEGIN_SRC sh
      FROM alpine:edge

      # ADD rutaDelHost rutaEnElDocker
      # 1. La primera ruta puede ser de un archivo, o directorio del Host,
      # es el que vamos a copiar al Contenedor
      # 2. La segunda ruta, está dentro del contenedor, y es donde copiaremos los archivos
      ADD default /etc/ngnix/sites-available/default
      ADD php-conf.conf /etc/php/7.2/php-conf.conf
    #+END_SRC

    #+BEGIN_EXAMPLE
    Una breve explicación del código anterior

    1. El primer parámetro de ADD es la ruta origen del HOST, es decir el ordendor donde ejecutamos nuestro docker
    2. El segundo parámetro es la ruta destino al Contenedor, donde se agregarán los directorios/archivos
    #+END_EXAMPLE

*** (ENTRYPOINT) Pasar scripts por parámetro
    - Podemos ejecutar scripts que ejecuten comandos de configuración (Ej. apache, php, ...)

    #+NAME: dockerfile-comando-entrypoint
    #+BEGIN_SRC sh
      FROM alpine:edge

      # no es necesario especificar la extensión .sh
      ENTRYPOINT ["start-container"]
    #+END_SRC
   
    #+NAME: start-container.sh
    #+BEGIN_SRC sh
      #!/usr/bin/env bash

      # este script será ejecutado por la linea ENTRYPOINT en el Dockerfile

      # 1. Verificamos si existe el directorio composer en la ruta actual
      if [ ! -d ./composer ]; then
      # 2. Si no existe, lo creamos
          mkdir ./composer
      fi
      # 3. Le asignamos permisos de lectura y escritura
      chmod -R ugo+rw ./composer
    #+END_SRC
