dist/maquinas-virtuales.html
<div id="outline-container-org2d89c2b" class="outline-4">
<h4 id="org2d89c2b"><span class="section-number-4">2.8.3</span> Referencias</h4>
</div>
</div>
<div id="outline-container-org43553bb" class="outline-3">
<h3 id="org43553bb"><span class="section-number-3">2.9</span> Ejemplos</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">
<pre class="src src-sh"># Creamos una red para conectar el contenedor
docker network create --driver=bridge red-jelou

# creamos el contenedor llamado prueba1 que tenga linux alpine edge
# montamos un volumen llamado datos-jelou que usará
# le asignamos la red que creamos previamente
# y que ejecute el comando "sh" al iniciar (caso contrario no podemos acceder)
docker run --name=prueba1 -it -v datos-jelou:/opt --network=red-jelou alpine:edge sh

# analizamos el punto de montaje, osea donde se creó el volumen en el Host
# - el volumen se puede compartir entre otros contenedores
docker volume inspect datos-jelou

# analizamos la red,
# que otros contenedores la utilizan
docker network red-jelou

</pre>
</div>

<blockquote>
<p>
run
</p>

<p>
-it
</p>

<p>
-v jelou:/opt
</p>

<p>
–network=red-jelou
</p>

<p>
alpine:edge
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org48fb01c" class="outline-3">
<h3 id="org48fb01c"><span class="section-number-3">2.10</span> Referencias</h3>
<div class="outline-text-3" id="text-2-10">
<ul class="org-ul">
<li><a href="https://docs.docker.com/develop/develop-images/dockerfile_best-practices/">Best practices for writing Dockerfiles - docs.docker.com</a></li>
<li><a href="https://docs.docker.com/engine/reference/commandline/container_prune/">https://docs.docker.com/engine/reference/commandline/container_prune/</a></li>
<li><a href="https://github.com/rocker-org/rocker/wiki/How-to-save-data">How to save data - github.com/rocker-org</a></li>
<li><a href="https://www.digitalocean.com/community/tutorials/como-instalar-y-usar-docker-en-ubuntu-18-04-1-es">Como instalar y usar Docker en Ubuntu 18.04 - Digitalocean.com</a></li>
<li><a href="https://www.ionos.es/digitalguide/servidores/configuracion/tutorial-docker-instalacion-y-primeros-pasos/">Tutorial Docker - Instalación y primeros pasos - Ionos.es</a></li>
<li><a href="https://colorfield.be/blog/cleaning-lando-containers">Cleaning up containers - colorfield.de</a></li>
<li><a href="https://blog.hipolabs.com/understanding-docker-without-losing-your-shit-cf2b30307c63">Understanding Docker - Blog hipolabs</a></li>
<li><a href="https://docs.docker.com/engine/reference/commandline/commit/">Docker commit - Docker.com</a></li>

<li><a href="https://www.youtube.com/watch?v=PbiYll21Jxg&amp;list=PLZdsdjcJ44WU_cY2Y1LFLnmsSjFD5BZLZ">Playlist - DOcker container course (el mejor por ahora)</a></li>
<li><a href="https://www.youtube.com/watch?v=vjnOIE-CwMU&amp;list=PLqRCtm0kbeHAep1hc7yW-EZQoAJqSTgD-&amp;index=2">Video - DOcker - primeros pasos</a></li>
<li><a href="https://www.youtube.com/watch?v=6idFknRIOp4&amp;t=201s">Video - Aprender docker en 14min</a></li>

<li><a href="https://stackoverflow.com/questions/21871479/docker-cant-connect-to-docker-daemon">https://stackoverflow.com/questions/21871479/docker-cant-connect-to-docker-daemon</a></li>
<li><a href="https://www.digitalocean.com/community/questions/how-to-fix-docker-got-permission-denied-while-trying-to-connect-to-the-docker-daemon-socket">https://www.digitalocean.com/community/questions/how-to-fix-docker-got-permission-denied-while-trying-to-connect-to-the-docker-daemon-socket</a></li>
<li><a href="https://manjaro.site/how-to-install-docker-on-manjaro-18-0/">https://manjaro.site/how-to-install-docker-on-manjaro-18-0/</a></li>
</ul>
</div>
</div>

<div id="outline-container-org336a0ab" class="outline-3">
<h3 id="org336a0ab"><span class="section-number-3">2.11</span> Referencias - Videos</h3>
<div class="outline-text-3" id="text-2-11">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=r6bxsuDq6wY&amp;list=PLmBbXLdrZ-O3B3rsLOVHufTL_wmickgLf&amp;ab_channel=ServersforHackers">Playlist #1</a></li>
<li><a href="https://www.youtube.com/watch?v=jjuIEHhXX7k&amp;list=PLmBbXLdrZ-O0GxzRkPdY6zUe9XRYNt38A&amp;ab_channel=ServersforHackers">Playlist #2</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgb4483e4" class="outline-2">
<h2 id="orgb4483e4"><span class="section-number-2">3</span> Dockerfile</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga23d0d5" class="outline-3">
<h3 id="orga23d0d5"><span class="section-number-3">3.1</span> Conceptos</h3>
</div>
<div id="outline-container-org60cd0e3" class="outline-3">
<h3 id="org60cd0e3"><span class="section-number-3">3.2</span> Comandos básicos</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org8219cb3" class="outline-4">
<h4 id="org8219cb3"><span class="section-number-4">3.2.1</span> (BUILD) Crear Imagen</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
La idea del dockerfile es crear imagenes, para luego crear contenedores
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org44905e5"># usamos el comando build
# seguido del parámetro -t
# seguido de la imagen y un tag que especifique la versión (opcional)
# por último la ruta donde está el Dockerfile, si se deja el punto se refiere a la ruta actual
docker build -t nombreImagen:algunTag .
</pre>
</div>
</div>
</div>
<div id="outline-container-org7b2347f" class="outline-4">
<h4 id="org7b2347f"><span class="section-number-4">3.2.2</span> (COPY) Copiar archivos</h4>
<div class="outline-text-4" id="text-3-2-2">
<ul class="org-ul">
<li>A diferencia del comando <b>ADD</b> no descomprime los archivos (Ej. .jar, .gz,..) que quizás no es la intención,</li>
</ul>
<p>
y los mueve a la ruta destino.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org6bd9f80">FROM debian

# resources/app.jar es una ruta que pertenece al host, son los archivos y directorios que queremos copiar
# /app es una ruta que está dentro del contenedor de docker, es donde se copiarán los archivos
COPY resources/app.jar /app

# este comando se ejecuta al iniciar el contenedor
# y ejecuta el archivo .jar que copiamos al contenedor
CMD ["java", "-jar", "app/app.jar"]
</pre>
</div>
</div>
</div>
<div id="outline-container-org6824d1e" class="outline-4">
<h4 id="org6824d1e"><span class="section-number-4">3.2.3</span> (ADD) Descargar y Descomprimir archivos</h4>
<div class="outline-text-4" id="text-3-2-3">
<ul class="org-ul">
<li>Puede descargar archivos de url de internet y agregarlos a una ruta del contenedor</li>
<li>Permite descomprimir archivos (comportamiento quizás no deseado si se confunde con el comando <b>COPY</b>)</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh" id="orgf4469b5">FROM alpine:edge

# ADD rutaDelHost rutaEnElDocker
# 1. La primera ruta puede ser de un archivo, o directorio del Host,
# es el que vamos a copiar al Contenedor
# 2. La segunda ruta, está dentro del contenedor, y es donde copiaremos los archivos
ADD default /etc/ngnix/sites-available/default
ADD php-conf.conf /etc/php/7.2/php-conf.conf
</pre>
</div>

<pre class="example">Una breve explicación del código anterior

1. El primer parámetro de ADD es la ruta origen del HOST, es decir el ordendor donde ejecutamos nuestro docker
2. El segundo parámetro es la ruta destino al Contenedor, donde se agregarán los directorios/archivos
</pre>
</div>
</div>

<div id="outline-container-orgb2626b1" class="outline-4">
<h4 id="orgb2626b1"><span class="section-number-4">3.2.4</span> (ENTRYPOINT) Pasar scripts por parámetro</h4>
<div class="outline-text-4" id="text-3-2-4">
<ul class="org-ul">
<li>Podemos ejecutar scripts que ejecuten comandos de configuración (Ej. apache, php, …)</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh" id="org6c61e42">FROM alpine:edge

# no es necesario especificar la extensión .sh
ENTRYPOINT ["start-container"]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh" id="org8994342">#!/usr/bin/env bash

# este script será ejecutado por la linea ENTRYPOINT en el Dockerfile

# 1. Verificamos si existe el directorio composer en la ruta actual
if [ ! -d ./composer ]; then
# 2. Si no existe, lo creamos
    mkdir ./composer
fi
# 3. Le asignamos permisos de lectura y escritura
chmod -R ugo+rw ./composer
</pre>
</div>
</div>
</div>
