src/org-files/maquinas-virtuales.org
*** (CMD) Comandos por defecto
    - Se ejecuta mientras corre el contenedor
    - Para ejecutar varios comandos por defecto utilizar un arreglo entre corchetes
    - Si pasamos un parámetro al docker run o por la terminal, pisará el de CMD

    #+NAME: ejemplosh
    #+BEGIN_SRC sh :var x="hola" :var y="chau" :export none
      echo "var x= $x , y= $y"
    #+END_SRC
    
    #+CALL: ejemplosh(y="My y")

    #+RESULTS:
    | var x= hola | y= My y |

    #+NAME: Dockerfile
    #+BEGIN_SRC sh
      FROM alpine:edge

      CMD echo "Hola"
      #CMD ["/bin/echo", "hola"]
      #CMD ["echo", "hola"]
    #+END_SRC
   
    #+NAME: ejemplo-dockerfile-cmd 
    #+BEGIN_SRC sh
      docker build -t miservidor .
      docker run -it miservidor
    #+END_SRC
*** (RUN) Ejecutar comandos
    - Por cada linea que repitamos RUN, se creará una capa de..?
    - Para escribir varios comandos en una capa, utiliza el slash invertido
    
    #+BEGIN_SRC sh
      FROM ubuntu:trusty

      RUN apt-get install -y emacs
    #+END_SRC
    
    #+BEGIN_SRC sh
      FROM alpine:edge

      RUN apk add --force emacs
    #+END_SRC
*** Otros

** Ejemplos
   Cada linea del Dockerfile es *cacheada* en memoria, por lo que si en una linea decimos que
   
   Utilidad del *slash invertido* es evitar tener varias *capas* que se guardan en caché, y luego generan problemas.
   Si por ejemplo en una linea hacemos que instale algunos paquetes (Ej. apt-get install git emacs vim) y 
   encima de esta linea agregamos que instale otros paquetes (Ej. apt-get install java haskell) es posible que no se ejecute
   esta segunda (?)
   
   #+NAME: ejemplo1-dockerfile
   #+BEGIN_SRC sh
      FROM ubuntu:trusty

      MANTAINER jelou

      RUN apt-get install -y \
          git emacs \
          && apt-get clean \
          && rm -rf /tmp/* /var/tmp/* \
                && echo "8.8.8.8 # google dns" >> /etc/hosts
      ADD ./images www/html/images

      EXPOSE 80
      CMD ["Hola"]
   #+END_SRC
* Docker Compose
** Conceptos
   - Manejar varios contenedores en un archivo
   - Se puede combinar con Dockerfile
** Instalación && Configuración
   Intenté de instalar con pacman -S docker-compose pero tiraba error por falta de packages
   Lo instalé mediante pip install docker-compose
   
   #+name: docker-compose-ejemplo
   #+BEGIN_SRC yaml
     # ES IMPORTANTE LA TABULACION, si no crashea
     version: "2.1"
     services:
       irc:
         # imagen que usará de base
         image: inspircd/inspircd-docker
         # le asignamos un nombre de referencia
         container_name: irc
         # puertos que usaremos
         # puertoHost:puertoContenedor
         # - puertoHost es el que usaremos en el host, donde corremos docker
         # - puertoContenedor el que usa la aplicación dentro del contenedor
         ports:
           - "6667:6667"
         # montamos un volumen, con directorios/archivos que apareceran en el contenedor
         # carpetaDelHost:rutaDelContenedor
         # - carpetaDelHost, contiene lo que aparecerá en el contenedor
         # - carpetaDelContenedor, es la carpeta que se creará y aparecerá en el contenedor
         volumes:
           - configs:/CONFIGURACIONES/
         # para configuraciones personalizadas
         environment:
           INSPIRCD_SERVER_NAME: "irc.localhost"
           INSPIRCD_SERVER_DESCRIPTION: "Probando..."
     # 
     volumes:
       configs:
   #+END_SRC
** Comandos Básicos 
   #+name: docker-compose-comandos
   #+BEGIN_SRC sh
     # corremos el docker-compose.yml de la ruta actual
     # up: crea el contenedor y lo ejecuta
     # -d: lo ejecuta en segundo plano
     # si no usamos -d, no podremos seguir utilizando la sesión de la terminal
     docker-compose up -d

     # acceder via terminal
     # en compose-docker los contenedores son servicios
     docker-compose exec nombreDelServicio sh
     # alternativa
     docker-compose exec nombreDelServicio bash

     # muestra los contenedores (en la ruta actual)
     docker-composer ps
   #+END_SRC
   
** Ejemplos
   #+BEGIN_SRC yaml
     version: "2.1"
     services:
       # entramos con docker exec -it miServidorAlpine sh
       ngnix:
         image: nginx:alpine
         container_name: miServidorAlpine
         # restart: always
         ports:
           - "81:80"
         volumes:
           # - este volumen, se crea dentro de /var/lib/docker/volumes
           # y apunta a la ruta del contenedor que aparece seguido de los dos puntos 
           # - data hace referencia al volumen que configuramos al final de este archivo
            - data:/usr/share/nginx/html:ro
           # el directorio "application" tiene que estar en la misma ruta
           # que este archivo Docker-compose.yml
           #- ./application:/usr/share/nginx/html:ro
       # redis:
       #   image: redis:alpine
       #   networks:
       #     - appnet

     # networks:
     #   appnet:
     #     driver: "bridge"

     # se va a montar un volumen en la ruta de docker del host
     # el nombre tendrá como prefijo el nombre del directorio donde está este docker-compose
     # seguido del nombre que le asignemos, en este caso data
     volumes:
       data:
         driver: "local"
   #+END_SRC
** Referencias Web
   1. [[https://docs.docker.com/compose/gettingstarted/][Getting Started - docs.docker.com]]
** Referencias Youtube
   1. [[https://www.youtube.com/watch?v=pxMCpYrnzwM][Todo sobre docker compose - Webinars con Agilia]]
   2. [[https://www.youtube.com/watch?v=G_-R2dz6T5U][Introduccion a Docker]]
** Issues Comunes
   1. [[https://stackoverflow.com/questions/36249744/interactive-shell-using-docker-compose][Interactive Shell - stackoverflow.com]]
* Docker Tips
** Ejecutar contenedores al iniciar el sistema
   Si tenemos algún problema en nuestro ordenador (se reinicia, se apaga, cuelga, error, etc..)
   podemos usar el parámetro *always*

   #+NAME: docker-compose
   #+BEGIN_SRC yaml
     version: "3.9"
     services:
       redis:
         image: redis:alpine
         # se reinicia con un máximo de 10 intentos
         restart: on-failure:10
       ngnix:
         image: ngnix:alpine
         # se reinicia siempre
         restart: always

   #+END_SRC
   
