dist/maquinas-virtuales.html
<div id="outline-container-org45f6e2a" class="outline-4">
<h4 id="org45f6e2a"><span class="section-number-4">3.2.5</span> (CMD) Comandos por defecto</h4>
<div class="outline-text-4" id="text-3-2-5">
<ul class="org-ul">
<li>Se ejecuta mientras corre el contenedor</li>
<li>Para ejecutar varios comandos por defecto utilizar un arreglo entre corchetes</li>
<li>Si pasamos un parámetro al docker run o por la terminal, pisará el de CMD</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh" id="org57265bd">echo "var x= $x , y= $y"
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">var x= hola</td>
<td class="org-left">y= My y</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-sh" id="org3e70447">FROM alpine:edge

CMD echo "Hola"
#CMD ["/bin/echo", "hola"]
#CMD ["echo", "hola"]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh" id="org657f540">docker build -t miservidor .
docker run -it miservidor
</pre>
</div>
</div>
</div>
<div id="outline-container-orgec7c2cc" class="outline-4">
<h4 id="orgec7c2cc"><span class="section-number-4">3.2.6</span> (RUN) Ejecutar comandos</h4>
<div class="outline-text-4" id="text-3-2-6">
<ul class="org-ul">
<li>Por cada linea que repitamos RUN, se creará una capa de..?</li>
<li>Para escribir varios comandos en una capa, utiliza el slash invertido</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">FROM ubuntu:trusty

RUN apt-get install -y emacs
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">FROM alpine:edge

RUN apk add --force emacs
</pre>
</div>
</div>
</div>
<div id="outline-container-org6940337" class="outline-4">
<h4 id="org6940337"><span class="section-number-4">3.2.7</span> Otros</h4>
</div>
</div>

<div id="outline-container-org89358a3" class="outline-3">
<h3 id="org89358a3"><span class="section-number-3">3.3</span> Ejemplos</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Cada linea del Dockerfile es <b>cacheada</b> en memoria, por lo que si en una linea decimos que
</p>

<p>
Utilidad del <b>slash invertido</b> es evitar tener varias <b>capas</b> que se guardan en caché, y luego generan problemas.
Si por ejemplo en una linea hacemos que instale algunos paquetes (Ej. apt-get install git emacs vim) y 
encima de esta linea agregamos que instale otros paquetes (Ej. apt-get install java haskell) es posible que no se ejecute
esta segunda (?)
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org587fa3b">FROM ubuntu:trusty

MANTAINER jelou

RUN apt-get install -y \
    git emacs \
    &amp;&amp; apt-get clean \
    &amp;&amp; rm -rf /tmp/* /var/tmp/* \
	  &amp;&amp; echo "8.8.8.8 # google dns" &gt;&gt; /etc/hosts
ADD ./images www/html/images

EXPOSE 80
CMD ["Hola"]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org57e269f" class="outline-2">
<h2 id="org57e269f"><span class="section-number-2">4</span> Docker Compose</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0fc92a8" class="outline-3">
<h3 id="org0fc92a8"><span class="section-number-3">4.1</span> Conceptos</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Manejar varios contenedores en un archivo</li>
<li>Se puede combinar con Dockerfile</li>
</ul>
</div>
</div>
<div id="outline-container-orgb678b24" class="outline-3">
<h3 id="orgb678b24"><span class="section-number-3">4.2</span> Instalación &amp;&amp; Configuración</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Intenté de instalar con pacman -S docker-compose pero tiraba error por falta de packages
Lo instalé mediante pip install docker-compose
</p>

<div class="org-src-container">
<pre class="src src-yaml" id="org71f6389"># ES IMPORTANTE LA TABULACION, si no crashea
version: "2.1"
services:
  irc:
    # imagen que usará de base
    image: inspircd/inspircd-docker
    # le asignamos un nombre de referencia
    container_name: irc
    # puertos que usaremos
    # puertoHost:puertoContenedor
    # - puertoHost es el que usaremos en el host, donde corremos docker
    # - puertoContenedor el que usa la aplicación dentro del contenedor
    ports:
      - "6667:6667"
    # montamos un volumen, con directorios/archivos que apareceran en el contenedor
    # carpetaDelHost:rutaDelContenedor
    # - carpetaDelHost, contiene lo que aparecerá en el contenedor
    # - carpetaDelContenedor, es la carpeta que se creará y aparecerá en el contenedor
    volumes:
      - configs:/CONFIGURACIONES/
    # para configuraciones personalizadas
    environment:
      INSPIRCD_SERVER_NAME: "irc.localhost"
      INSPIRCD_SERVER_DESCRIPTION: "Probando..."
# 
volumes:
  configs:
</pre>
</div>
</div>
</div>
<div id="outline-container-org750702c" class="outline-3">
<h3 id="org750702c"><span class="section-number-3">4.3</span> Comandos Básicos</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-sh" id="org21056ac"># corremos el docker-compose.yml de la ruta actual
# up: crea el contenedor y lo ejecuta
# -d: lo ejecuta en segundo plano
# si no usamos -d, no podremos seguir utilizando la sesión de la terminal
docker-compose up -d

# acceder via terminal
# en compose-docker los contenedores son servicios
docker-compose exec nombreDelServicio sh
# alternativa
docker-compose exec nombreDelServicio bash

# muestra los contenedores (en la ruta actual)
docker-composer ps
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9d7165" class="outline-3">
<h3 id="orgb9d7165"><span class="section-number-3">4.4</span> Ejemplos</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-yaml">version: "2.1"
services:
  # entramos con docker exec -it miServidorAlpine sh
  ngnix:
    image: nginx:alpine
    container_name: miServidorAlpine
    # restart: always
    ports:
      - "81:80"
    volumes:
      # - este volumen, se crea dentro de /var/lib/docker/volumes
      # y apunta a la ruta del contenedor que aparece seguido de los dos puntos 
      # - data hace referencia al volumen que configuramos al final de este archivo
       - data:/usr/share/nginx/html:ro
      # el directorio "application" tiene que estar en la misma ruta
      # que este archivo Docker-compose.yml
      #- ./application:/usr/share/nginx/html:ro
  # redis:
  #   image: redis:alpine
  #   networks:
  #     - appnet

# networks:
#   appnet:
#     driver: "bridge"

# se va a montar un volumen en la ruta de docker del host
# el nombre tendrá como prefijo el nombre del directorio donde está este docker-compose
# seguido del nombre que le asignemos, en este caso data
volumes:
  data:
    driver: "local"
</pre>
</div>
</div>
</div>
<div id="outline-container-org24c0434" class="outline-3">
<h3 id="org24c0434"><span class="section-number-3">4.5</span> Referencias Web</h3>
<div class="outline-text-3" id="text-4-5">
<ol class="org-ol">
<li><a href="https://docs.docker.com/compose/gettingstarted/">Getting Started - docs.docker.com</a></li>
</ol>
</div>
</div>
<div id="outline-container-org170c037" class="outline-3">
<h3 id="org170c037"><span class="section-number-3">4.6</span> Referencias Youtube</h3>
<div class="outline-text-3" id="text-4-6">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=pxMCpYrnzwM">Todo sobre docker compose - Webinars con Agilia</a></li>
<li><a href="https://www.youtube.com/watch?v=G_-R2dz6T5U">Introduccion a Docker</a></li>
</ol>
</div>
</div>
<div id="outline-container-org5372bdd" class="outline-3">
<h3 id="org5372bdd"><span class="section-number-3">4.7</span> Issues Comunes</h3>
<div class="outline-text-3" id="text-4-7">
<ol class="org-ol">
<li><a href="https://stackoverflow.com/questions/36249744/interactive-shell-using-docker-compose">Interactive Shell - stackoverflow.com</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org49f9eb5" class="outline-2">
<h2 id="org49f9eb5"><span class="section-number-2">5</span> Docker Tips</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgdca0195" class="outline-3">
<h3 id="orgdca0195"><span class="section-number-3">5.1</span> Ejecutar contenedores al iniciar el sistema</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Si tenemos algún problema en nuestro ordenador (se reinicia, se apaga, cuelga, error, etc..)
podemos usar el parámetro <b>always</b>
</p>

<div class="org-src-container">
<pre class="src src-yaml" id="orgb160f44">version: "3.9"
services:
  redis:
    image: redis:alpine
    # se reinicia con un máximo de 10 intentos
    restart: on-failure:10
  ngnix:
    image: ngnix:alpine
    # se reinicia siempre
    restart: always

</pre>
</div>
</div>
</div>
