src/org-files/maquinas-virtuales.org
** Conocer el timestamp de los logs
   Con el comando *docker logs nombreContenedor* nos muestra un historial de logs del contenedor,
   pero podemos conocer en detalle cuando sucedió utilizando el parámetro *t*
  
   #+NAME: docker-logs-timestamp 
   #+BEGIN_SRC sh 
     docker logs --tail=10 -t nombreAlgunContenedor

     # con --tail=10, indicamos que nos muestre los últimos 10 eventos del historial de logs
     # con -t, indicamos que queremos conocer el timestamp de cada evento sucedido
   #+END_SRC
* Servicios Básicos
  Algunos de los servicios que más utilizo son
** Nginx
  para servidor http, similar a apache2 pero con menos configuración
** Duckdns 
  - duckdns para enmascarar por asi decir la ip, como no-ip
*** Referencias
    - [[https://www.duckdns.org/][Duckdns - Sitio Oficial]]
    - [[https://hub.docker.com/r/linuxserver/duckdns/][DuckDns - hub.docker.com]]
** Inspircd
   para servidor irc
** Referencias Web
   1. [[https://github.com/inspircd/inspircd-docker][Inspircd Docker - hub.docker.com]]
   2. [[https://github.com/inspircd/inspircd-docker][Inspircd - github.com]]
** Videotutoriales
   1. [[https://www.youtube.com/watch?v=67f9iptWqt0&t=492s][Host a Deep web IRC Server - youtube.com]]
* Redes
** Firewall
   Usamos ufw como firewall
*** Referencias
    1. [[https://esgeeks.com/abrir-cerrar-puertos-linux/][Abrir y cerrar puertos - esgeeks.com]]
    2. 
** Pendiente
  Entender las diferencias.. 
  Las ip que estas utilizando son

  http://192.168.1.88/ esta es tu maquina local
  http://172.21.0.2/ es la ip del contenedor docker que tiene el ngnix
* Proxy Squid y Tor
 - https://www.youtube.com/watch?v=vj00RVHGxFg
 - https://www.youtube.com/watch?v=IJ-1Dksex5k

* Glosario
  1. Daemon
  2. Curl
  3. Sandbox
  4. Kubernetes
  5. Timestamp
  6. Runtime cpu
