dist/maquinas-virtuales.html

<div id="outline-container-org38ba533" class="outline-3">
<h3 id="org38ba533"><span class="section-number-3">5.2</span> Conocer el timestamp de los logs</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Con el comando <b>docker logs nombreContenedor</b> nos muestra un historial de logs del contenedor,
pero podemos conocer en detalle cuando sucedió utilizando el parámetro <b>t</b>
</p>

<div class="org-src-container">
<pre class="src src-sh" id="orgadfd6de">docker logs --tail=10 -t nombreAlgunContenedor

# con --tail=10, indicamos que nos muestre los últimos 10 eventos del historial de logs
# con -t, indicamos que queremos conocer el timestamp de cada evento sucedido
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org79b93b7" class="outline-2">
<h2 id="org79b93b7"><span class="section-number-2">6</span> Servicios Básicos</h2>
<div class="outline-text-2" id="text-6">
<p>
Algunos de los servicios que más utilizo son
</p>
</div>
<div id="outline-container-org86d9073" class="outline-3">
<h3 id="org86d9073"><span class="section-number-3">6.1</span> Nginx</h3>
<div class="outline-text-3" id="text-6-1">
<p>
para servidor http, similar a apache2 pero con menos configuración
</p>
</div>
</div>
<div id="outline-container-org3f85acd" class="outline-3">
<h3 id="org3f85acd"><span class="section-number-3">6.2</span> Duckdns</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>duckdns para enmascarar por asi decir la ip, como no-ip</li>
</ul>
</div>
<div id="outline-container-orgf193787" class="outline-4">
<h4 id="orgf193787"><span class="section-number-4">6.2.1</span> Referencias</h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li><a href="https://www.duckdns.org/">Duckdns - Sitio Oficial</a></li>
<li><a href="https://hub.docker.com/r/linuxserver/duckdns/">DuckDns - hub.docker.com</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3cc4a89" class="outline-3">
<h3 id="org3cc4a89"><span class="section-number-3">6.3</span> Inspircd</h3>
<div class="outline-text-3" id="text-6-3">
<p>
para servidor irc
</p>
</div>
</div>
<div id="outline-container-orgb1a75a5" class="outline-3">
<h3 id="orgb1a75a5"><span class="section-number-3">6.4</span> Referencias Web</h3>
<div class="outline-text-3" id="text-6-4">
<ol class="org-ol">
<li><a href="https://github.com/inspircd/inspircd-docker">Inspircd Docker - hub.docker.com</a></li>
<li><a href="https://github.com/inspircd/inspircd-docker">Inspircd - github.com</a></li>
</ol>
</div>
</div>
<div id="outline-container-org490f62f" class="outline-3">
<h3 id="org490f62f"><span class="section-number-3">6.5</span> Videotutoriales</h3>
<div class="outline-text-3" id="text-6-5">
<ol class="org-ol">
<li><a href="https://www.youtube.com/watch?v=67f9iptWqt0&amp;t=492s">Host a Deep web IRC Server - youtube.com</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org036c473" class="outline-2">
<h2 id="org036c473"><span class="section-number-2">7</span> Redes</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org58fe49f" class="outline-3">
<h3 id="org58fe49f"><span class="section-number-3">7.1</span> Firewall</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Usamos ufw como firewall
</p>
</div>
<div id="outline-container-orgab5bdf4" class="outline-4">
<h4 id="orgab5bdf4"><span class="section-number-4">7.1.1</span> Referencias</h4>
<div class="outline-text-4" id="text-7-1-1">
<ol class="org-ol">
<li><a href="https://esgeeks.com/abrir-cerrar-puertos-linux/">Abrir y cerrar puertos - esgeeks.com</a></li>
<li></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org74577af" class="outline-3">
<h3 id="org74577af"><span class="section-number-3">7.2</span> Pendiente</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Entender las diferencias.. 
Las ip que estas utilizando son
</p>

<p>
<a href="http://192.168.1.88/">http://192.168.1.88/</a> esta es tu maquina local
<a href="http://172.21.0.2/">http://172.21.0.2/</a> es la ip del contenedor docker que tiene el ngnix
</p>
</div>
</div>
</div>
<div id="outline-container-org7c19630" class="outline-2">
<h2 id="org7c19630"><span class="section-number-2">8</span> Proxy Squid y Tor</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=vj00RVHGxFg">https://www.youtube.com/watch?v=vj00RVHGxFg</a></li>
<li><a href="https://www.youtube.com/watch?v=IJ-1Dksex5k">https://www.youtube.com/watch?v=IJ-1Dksex5k</a></li>
</ul>
</div>
</div>

<div id="outline-container-org45fcb6c" class="outline-2">
<h2 id="org45fcb6c"><span class="section-number-2">9</span> Glosario</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>Daemon</li>
<li>Curl</li>
<li>Sandbox</li>
<li>Kubernetes</li>
<li>Timestamp</li>
<li>Runtime cpu</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-03-31 mié 00:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>


</body></html>